cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
/*
 * ESP32-Notifier
 * Version: 3.2
 * Multi-channel notification system with web configuration
 *
 * New in v3.2:
 * - BMP180 temperature and pressure sensor support
 * - Real-time environmental monitoring (temperature, pressure, altitude)
 * - Configurable I2C pins for sensor connection
 * - Automatic sensor data inclusion in notifications
 * - Live sensor readings in web interface
 *
 * Features from v3.1:
 * - Cellular/4G support with SIM7670G modem
 * - Intelligent connection modes (WiFi Only, Cellular Only, WiFi+Cellular Backup)
 * - SMS notifications via cellular modem
 * - HTTP over cellular for Pushbullet and Telegram
 * - Per-service connection mode configuration
 * - Cellular status monitoring (operator, signal strength)
 *
 * Features from v3.0:
 * - ESP32-S3-SIM7670G-4G board support
 * - OV2640 camera integration with photo capture
 * - GPS/GNSS positioning support
 * - Photo attachments in notifications
 * - SD card storage for photos
 * - Board type selection
 *
 * Features from v2.0:
 * - Multi-input support (up to 4 switches)
 * - WiFi auto-reconnection
 * - Watchdog timer
 * - Web authentication
 * - Non-blocking operations
 * - Notification retry logic
 * - Rate limiting
 * - Test buttons for services
 * - ArduinoJson for safety
 */

#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <time.h>
#include <ArduinoJson.h>
#include <esp_task_wdt.h>

// Fix for ESP32-S3-SIM7670G USB Serial issue - redirect to hardware UART
// This board's USB CDC doesn't work properly, but hardware UART does
#define Serial Serial0

// Optional advanced libraries - will gracefully disable if not available
// Comment out any line below if you don't have that library installed
#define HAS_EMAIL_LIB
#define HAS_CAMERA_LIB  // Temporarily disabled - may be causing boot issues
#define HAS_GPS_LIB      // Temporarily disabled - may be causing boot issues
#define HAS_BMP180_LIB   // BMP180 temperature and pressure sensor

#ifdef HAS_EMAIL_LIB
  #include <ESP_Mail_Client.h>
#endif

#ifdef HAS_CAMERA_LIB
  #include "esp_camera.h"
  #include <SD_MMC.h>
  #include <SD.h>  // Alternative SPI-based SD library
  #include <SPI.h>
  #include <FS.h>
#endif

#ifdef HAS_GPS_LIB
  #include <TinyGPSPlus.h>
#endif

#ifdef HAS_BMP180_LIB
  #include <Wire.h>
  #include <Adafruit_BMP085.h>  // Works with both BMP085 and BMP180
#endif

#define VERSION "3.2-BMP180"
#define MAX_INPUTS 4
#define WDT_TIMEOUT 30

// Board type definitions
#define BOARD_GENERIC 0
#define BOARD_SIM7670G 1
#define BOARD_FREENOVE_S3 2

// Connection mode definitions
#define CONN_WIFI_ONLY 0
#define CONN_CELL_ONLY 1
#define CONN_WIFI_CELL_BACKUP 2

// SIM7670G modem pins
// NOTE: GPIO 43/44 are Serial0 (used for debug output), so we use GPIO 17/18 instead
// Modem pins based on Waveshare example
#define MODEM_TX_PIN 17
#define MODEM_RX_PIN 18
#define MODEM_PWR_EN_PIN 33   // Power enable pin (CRITICAL - must be HIGH)
#define MODEM_PWRKEY_PIN 41   // Power key pin
#define MODEM_RESET_PIN 42    // Reset pin

// Camera pin definitions for ESP32-S3-SIM7670G-4G (Waveshare)
#define SIM7670G_CAM_PWDN    -1
#define SIM7670G_CAM_RESET   -1
#define SIM7670G_CAM_XCLK    34
#define SIM7670G_CAM_SIOD    15
#define SIM7670G_CAM_SIOC    16
#define SIM7670G_CAM_Y9      14
#define SIM7670G_CAM_Y8      13
#define SIM7670G_CAM_Y7      12
#define SIM7670G_CAM_Y6      11
#define SIM7670G_CAM_Y5      10
#define SIM7670G_CAM_Y4      9
#define SIM7670G_CAM_Y3      8
#define SIM7670G_CAM_Y2      7
#define SIM7670G_CAM_VSYNC   36
#define SIM7670G_CAM_HREF    35
#define SIM7670G_CAM_PCLK    37

// Camera pin definitions for Freenove ESP32-S3
// Based on datasheet: GPIO11,9,8,10,12,18,17,16 for data
#define FREENOVE_CAM_PWDN    -1
#define FREENOVE_CAM_RESET   -1
#define FREENOVE_CAM_XCLK    15
#define FREENOVE_CAM_SIOD    4   // I2C SDA
#define FREENOVE_CAM_SIOC    5   // I2C SCL
#define FREENOVE_CAM_Y9      16
#define FREENOVE_CAM_Y8      17
#define FREENOVE_CAM_Y7      18
#define FREENOVE_CAM_Y6      12
#define FREENOVE_CAM_Y5      10
#define FREENOVE_CAM_Y4      8
#define FREENOVE_CAM_Y3      9
#define FREENOVE_CAM_Y2      11
#define FREENOVE_CAM_VSYNC   6
#define FREENOVE_CAM_HREF    7
#define FREENOVE_CAM_PCLK    13

// Legacy pin definitions (for backward compatibility with existing code)
// These will be set dynamically based on board type
#define CAM_PIN_PWDN    SIM7670G_CAM_PWDN
#define CAM_PIN_RESET   SIM7670G_CAM_RESET
#define CAM_PIN_XCLK    SIM7670G_CAM_XCLK
#define CAM_PIN_SIOD    SIM7670G_CAM_SIOD
#define CAM_PIN_SIOC    SIM7670G_CAM_SIOC
#define CAM_PIN_Y9      SIM7670G_CAM_Y9
#define CAM_PIN_Y8      SIM7670G_CAM_Y8
#define CAM_PIN_Y7      SIM7670G_CAM_Y7
#define CAM_PIN_Y6      SIM7670G_CAM_Y6
#define CAM_PIN_Y5      SIM7670G_CAM_Y5
#define CAM_PIN_Y4      SIM7670G_CAM_Y4
#define CAM_PIN_Y3      SIM7670G_CAM_Y3
#define CAM_PIN_Y2      SIM7670G_CAM_Y2
#define CAM_PIN_VSYNC   SIM7670G_CAM_VSYNC
#define CAM_PIN_HREF    SIM7670G_CAM_HREF
#define CAM_PIN_PCLK    SIM7670G_CAM_PCLK

// SD card pins for ESP32-S3-SIM7670G-4G (Waveshare)
#define SIM7670G_SD_CLK      5
#define SIM7670G_SD_CMD      4
#define SIM7670G_SD_DATA     6
#define SIM7670G_SD_CD       46

// SD card pins for Freenove ESP32-S3 (uses default SDMMC pins)
#define FREENOVE_SD_CLK      39  // GPIO39
#define FREENOVE_SD_CMD      38  // GPIO38
#define FREENOVE_SD_DATA     40  // GPIO40
#define FREENOVE_SD_CD       -1  // No card detect

// Backward compatibility
#define SD_MMC_CLK      SIM7670G_SD_CLK
#define SD_MMC_CMD      SIM7670G_SD_CMD
#define SD_MMC_DATA     SIM7670G_SD_DATA
#define SD_CD_PIN       SIM7670G_SD_CD

// GPS serial - using GNSS output from SIM7670G via AT commands
// GPS data will be retrieved via AT+CGNSINF from the modem

// Web server
WebServer server(80);
Preferences preferences;

#ifdef HAS_EMAIL_LIB
  SMTPSession* smtp = nullptr;  // Will be initialized when needed
#endif

// Board configuration
int board_type = BOARD_GENERIC;
bool camera_enabled = false;
bool gps_enabled = false;
bool sd_card_available = false;
bool camera_initialized = false;

#ifdef HAS_GPS_LIB
  TinyGPSPlus* gps = nullptr;  // Will be initialized only if needed
  HardwareSerial* GPS_Serial = nullptr;  // Will be initialized in setup()
#endif

// BMP180 sensor configuration
#ifdef HAS_BMP180_LIB
  Adafruit_BMP085* bmp = nullptr;  // Will be initialized only if needed
#endif
bool bmp180_enabled = false;
bool bmp180_initialized = false;
int bmp180_sda_pin = 21;  // Default I2C SDA pin
int bmp180_scl_pin = 22;  // Default I2C SCL pin
float last_temperature = 0.0;
float last_pressure = 0.0;
float last_altitude = 0.0;
bool include_bmp180_in_notifications = true;  // Include sensor data in notifications by default

