cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
// Cellular modem configuration
HardwareSerial* ModemSerial = nullptr;  // Will be initialized in setup()
bool cellular_enabled = false;
bool cellular_connected = false;
String cellular_operator = "";
int cellular_signal_strength = 0;
String apn = ""; // APN for cellular data
String modem_model = "";
String modem_imei = "";
String modem_iccid = "";
String modem_network_type = "";
bool modem_initialized = false;

// Connection modes per service
int pushbullet_conn_mode = CONN_WIFI_ONLY;
int email_conn_mode = CONN_WIFI_ONLY;
int telegram_conn_mode = CONN_WIFI_ONLY;
int sms_conn_mode = CONN_CELL_ONLY;

// SMS configuration
String sms_phone_number = "";
bool sms_enabled = false;

// WiFi state management
enum WiFiState { WIFI_IDLE, WIFI_CONNECTING, WIFI_CONNECTED, WIFI_FAILED };
WiFiState wifiState = WIFI_IDLE;
unsigned long wifiConnectStart = 0;
unsigned long lastWiFiCheck = 0;
const unsigned long WIFI_TIMEOUT = 20000;
const unsigned long WIFI_CHECK_INTERVAL = 30000;
bool wifiReconnecting = false;
bool apMode = false;
const char* AP_SSID = "ESP32-Notifier-Setup";
const char* AP_PASSWORD = "setup123";

// Time sync
bool timeIsSynced = false;
unsigned long lastTimeSyncAttempt = 0;
const unsigned long TIME_SYNC_RETRY = 3600000;

// Configuration
String wifi_ssid = "";
String wifi_password = "";
String web_username = "admin";
String web_password = "admin123";

// Pushbullet
String pushbullet_token = "";
bool pushbullet_enabled = false;

// Email
String smtp_host = "smtp.gmail.com";
int smtp_port = 465;
String smtp_email = "";
String smtp_password = "";
String recipient_email = "";
bool email_enabled = false;

// Telegram
String telegram_token = "";
String telegram_chat_id = "";
bool telegram_enabled = false;

// Messages
String notification_title = "Device Status Alert";

// Time
long gmt_offset = 0;  // UTC by default
int daylight_offset = 0;
const char* ntpServer = "pool.ntp.org";

// Input configuration structure
struct InputConfig {
  int pin;
  bool enabled;
  bool momentary_mode;
  bool capture_photo;  // NEW: Take photo when triggered
  bool include_gps;    // NEW: Include GPS in notification
  String name;
  String message_on;
  String message_off;
  bool lastState;
  bool currentState;
  unsigned long lastDebounceTime;
  unsigned long lastNotificationTime;
};

// Default pins to avoid conflicts:
// - Modem uses: 17, 18, 41, 42
// - Camera uses: 4-16, 34-37
// - SD card uses: 4, 5, 6, 46
// - Strapping pins (avoid): 0, 1, 2, 3, 45, 46
// Safe GPIO pins for SIM7670G: 21, 38, 39, 40, 47, 48
InputConfig inputs[MAX_INPUTS] = {
  {21, true, false, false, false, "Input 1", "Input 1 ON at {timestamp}", "Input 1 OFF at {timestamp}", LOW, LOW, 0, 0},
  {38, false, false, false, false, "Input 2", "Input 2 ON at {timestamp}", "Input 2 OFF at {timestamp}", LOW, LOW, 0, 0},
  {39, false, false, false, false, "Input 3", "Input 3 ON at {timestamp}", "Input 3 OFF at {timestamp}", LOW, LOW, 0, 0},
  {40, false, false, false, false, "Input 4", "Input 4 ON at {timestamp}", "Input 4 OFF at {timestamp}", LOW, LOW, 0, 0}
};

const unsigned long DEBOUNCE_DELAY = 50;
const unsigned long MIN_NOTIFICATION_INTERVAL = 5000;

// Notification retry queue
struct NotificationRetry {
  String title;
  String body;
  unsigned long retryTime;
  int retryCount;
  String service;
};

std::vector<NotificationRetry> retryQueue;
const int MAX_RETRIES = 3;
const unsigned long RETRY_DELAY = 60000;

// Logging system
struct LogEntry {
  String timestamp;
  String level;     // INFO, WARNING, ERROR, SUCCESS
  String message;
};

const int MAX_LOG_ENTRIES = 100;
LogEntry logBuffer[MAX_LOG_ENTRIES];
int logIndex = 0;
int logCount = 0;

// ========================================
// FORWARD DECLARATIONS
// ========================================

// Core functions
String getFormattedTime();
void addLog(String level, String message);

// Notification functions
void sendNotifications(String title, String body, String photoFile = "");
bool sendPushbulletNotification(String title, String body, String photoFile = "");
bool sendEmailNotification(String subject, String body, String photoFile = "");
bool sendTelegramNotification(String message, String photoFile = "");

// Cellular functions
bool sendSMS(String phoneNumber, String message);
String sendHTTPRequest(String url, String method, String payload = "", String contentType = "application/json");

// ========================================
// IMPLEMENTATION
// ========================================

void addLog(String level, String message) {
  // During early boot, just print to serial without complex operations
  static bool earlyBoot = true;

  if (earlyBoot) {
    Serial.print(F("[EARLY-"));
    Serial.print(level);
    Serial.print(F("] "));
    Serial.println(message);
    Serial.flush();
    // After first few calls, switch to normal mode
    static int callCount = 0;
    if (++callCount > 3) earlyBoot = false;
    return;
  }

  LogEntry entry;
  entry.timestamp = getFormattedTime();
  entry.level = level;
  entry.message = message;

  logBuffer[logIndex] = entry;
  logIndex = (logIndex + 1) % MAX_LOG_ENTRIES;
  if (logCount < MAX_LOG_ENTRIES) logCount++;

  // Also print to Serial
  Serial.print(F("["));
  Serial.print(entry.timestamp);
  Serial.print(F("] ["));
  Serial.print(level);
  Serial.print(F("] "));
  Serial.println(message);
  Serial.flush();
}

// Preference keys
namespace PrefKeys {
  const char* WIFI_SSID = "wifi_ssid";
  const char* WIFI_PASS = "wifi_pass";
  const char* WEB_USER = "web_user";
  const char* WEB_PASS = "web_pass";
  const char* PB_TOKEN = "pb_token";
  const char* PB_ENABLED = "pb_enabled";
  const char* SMTP_HOST = "smtp_host";
  const char* SMTP_PORT = "smtp_port";
  const char* SMTP_EMAIL = "smtp_email";
  const char* SMTP_PASS = "smtp_pass";
  const char* RCPT_EMAIL = "rcpt_email";
  const char* EMAIL_ENABLED = "email_enabled";
  const char* TG_TOKEN = "tg_token";
  const char* TG_CHAT = "tg_chat";
  const char* TG_ENABLED = "tg_enabled";
  const char* NOTIF_TITLE = "notif_title";
  const char* GMT_OFFSET = "gmt_offset";
  const char* DAY_OFFSET = "day_offset";
  // NEW: v3.0 preferences
  const char* BOARD_TYPE = "board_type";
  const char* CAMERA_EN = "camera_en";
  const char* GPS_EN = "gps_en";
  // NEW: v3.1 cellular preferences
  const char* CELL_EN = "cell_en";
  const char* APN = "apn";
  const char* PB_CONN_MODE = "pb_conn";
  const char* EMAIL_CONN_MODE = "email_conn";
  const char* TG_CONN_MODE = "tg_conn";
  const char* SMS_CONN_MODE = "sms_conn";
  const char* SMS_EN = "sms_en";
  const char* SMS_PHONE = "sms_phone";
  // BMP180 sensor preferences
  const char* BMP180_EN = "bmp180_en";
  const char* BMP180_SDA = "bmp180_sda";
  const char* BMP180_SCL = "bmp180_scl";
  const char* BMP180_IN_NOTIF = "bmp180_notif";
}

// ========================================
// CAMERA FUNCTIONS
// ========================================

