cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
#ifdef HAS_CAMERA_LIB
bool initCamera() {
  if (board_type == BOARD_GENERIC) {
    addLog("INFO", "Camera not available - board type is generic");
    return false;
  }

  Serial.println(F("Initializing OV2640 camera..."));
  Serial.printf("Free heap before camera init: %d bytes\n", ESP.getFreeHeap());
  if (psramFound()) {
    Serial.printf("PSRAM size: %d bytes\n", ESP.getPsramSize());
    Serial.printf("Free PSRAM: %d bytes\n", ESP.getFreePsram());
  }
  Serial.flush();

  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;

  // Set camera pins based on board type
  if (board_type == BOARD_SIM7670G) {
    config.pin_d0 = SIM7670G_CAM_Y2;
    config.pin_d1 = SIM7670G_CAM_Y3;
    config.pin_d2 = SIM7670G_CAM_Y4;
    config.pin_d3 = SIM7670G_CAM_Y5;
    config.pin_d4 = SIM7670G_CAM_Y6;
    config.pin_d5 = SIM7670G_CAM_Y7;
    config.pin_d6 = SIM7670G_CAM_Y8;
    config.pin_d7 = SIM7670G_CAM_Y9;
    config.pin_xclk = SIM7670G_CAM_XCLK;
    config.pin_pclk = SIM7670G_CAM_PCLK;
    config.pin_vsync = SIM7670G_CAM_VSYNC;
    config.pin_href = SIM7670G_CAM_HREF;
    config.pin_sccb_sda = SIM7670G_CAM_SIOD;
    config.pin_sccb_scl = SIM7670G_CAM_SIOC;
    config.pin_pwdn = SIM7670G_CAM_PWDN;
    config.pin_reset = SIM7670G_CAM_RESET;
  } else if (board_type == BOARD_FREENOVE_S3) {
    config.pin_d0 = FREENOVE_CAM_Y2;
    config.pin_d1 = FREENOVE_CAM_Y3;
    config.pin_d2 = FREENOVE_CAM_Y4;
    config.pin_d3 = FREENOVE_CAM_Y5;
    config.pin_d4 = FREENOVE_CAM_Y6;
    config.pin_d5 = FREENOVE_CAM_Y7;
    config.pin_d6 = FREENOVE_CAM_Y8;
    config.pin_d7 = FREENOVE_CAM_Y9;
    config.pin_xclk = FREENOVE_CAM_XCLK;
    config.pin_pclk = FREENOVE_CAM_PCLK;
    config.pin_vsync = FREENOVE_CAM_VSYNC;
    config.pin_href = FREENOVE_CAM_HREF;
    config.pin_sccb_sda = FREENOVE_CAM_SIOD;
    config.pin_sccb_scl = FREENOVE_CAM_SIOC;
    config.pin_pwdn = FREENOVE_CAM_PWDN;
    config.pin_reset = FREENOVE_CAM_RESET;
    config.xclk_freq_hz = 20000000;  // 20MHz for Freenove
  } else {
    // Default to SIM7670G pins if unknown board type
    config.pin_d0 = CAM_PIN_Y2;
    config.pin_d1 = CAM_PIN_Y3;
    config.pin_d2 = CAM_PIN_Y4;
    config.pin_d3 = CAM_PIN_Y5;
    config.pin_d4 = CAM_PIN_Y6;
    config.pin_d5 = CAM_PIN_Y7;
    config.pin_d6 = CAM_PIN_Y8;
    config.pin_d7 = CAM_PIN_Y9;
    config.pin_xclk = CAM_PIN_XCLK;
    config.pin_pclk = CAM_PIN_PCLK;
    config.pin_vsync = CAM_PIN_VSYNC;
    config.pin_href = CAM_PIN_HREF;
    config.pin_sccb_sda = CAM_PIN_SIOD;
    config.pin_sccb_scl = CAM_PIN_SIOC;
    config.pin_pwdn = CAM_PIN_PWDN;
    config.pin_reset = CAM_PIN_RESET;
    config.xclk_freq_hz = 16000000;  // 16MHz default
  }

  if (board_type == BOARD_SIM7670G) {
    config.xclk_freq_hz = 16000000;  // 16MHz for Waveshare
  }

  config.pixel_format = PIXFORMAT_JPEG;

  // Conservative configuration to avoid DMA overflow and stack issues
  // Start with small frame buffer and work up
  config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
  config.fb_location = CAMERA_FB_IN_PSRAM;
  config.frame_size = FRAMESIZE_VGA;  // Start small: 640x480
  config.jpeg_quality = 15;  // Higher number = lower quality = less memory
  config.fb_count = 1;  // Single buffer to minimize memory

  if(psramFound()){
    Serial.println(F("PSRAM found - using conservative settings to avoid overflow"));
    Serial.printf("PSRAM size: %d, Free PSRAM: %d\n", ESP.getPsramSize(), ESP.getFreePsram());
    // Use moderate settings - not maximum to avoid DMA overflow
    config.frame_size = FRAMESIZE_SVGA;  // 800x600 (not UXGA to avoid overflow)
    config.jpeg_quality = 12;
    config.fb_count = 1;  // Stay with single buffer for stability
    config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
  } else {
    Serial.println(F("ERROR: No PSRAM detected!"));
    Serial.println(F("This board REQUIRES PSRAM for camera operation"));
    if (board_type == BOARD_FREENOVE_S3) {
      Serial.println(F("Check Arduino IDE: Tools -> PSRAM -> OPI PSRAM"));
    } else {
      Serial.println(F("Check Arduino IDE: Tools -> PSRAM -> QSPI PSRAM"));
    }
    // Ultra-minimal settings without PSRAM
    config.frame_size = FRAMESIZE_QVGA;  // 320x240 - very small
    config.jpeg_quality = 20;
    config.fb_location = CAMERA_FB_IN_DRAM;
  }

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.print(F("Camera init failed: 0x"));
    Serial.println(err, HEX);
    addLog("ERROR", "Camera initialization failed: " + String(err, HEX));
    return false;
  }

  addLog("SUCCESS", "Camera initialized successfully");
  camera_initialized = true;
  return true;
}

String capturePhoto() {
  if (!camera_initialized || !camera_enabled) {
    addLog("WARNING", "Camera not initialized or disabled");
    return "";
  }

  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    addLog("ERROR", "Camera capture failed");
    return "";
  }

  String filename = "";
  if (sd_card_available) {
    Serial.println(F("Capturing photo to SD card..."));
    Serial.printf("Frame buffer size: %d bytes\n", fb->len);
    Serial.flush();

    // CRITICAL FIX: Camera operation disrupts SD_MMC peripheral
    // Re-initialize SD card connection after getting frame buffer
    Serial.println(F("Re-establishing SD card connection after camera capture..."));
    SD_MMC.end();
    delay(100);

    if (!SD_MMC.setPins(SD_MMC_CLK, SD_MMC_CMD, SD_MMC_DATA)) {
      Serial.println(F("WARNING: setPins() failed during SD reinit"));
    }

    if (!SD_MMC.begin("/sdcard", true)) {
      Serial.println(F("ERROR: SD card reinit failed after camera capture"));
      addLog("ERROR", "SD card reinit failed after camera capture");
      sd_card_available = false;
      esp_camera_fb_return(fb);
      return "";
    }

    Serial.println(F("SD card re-initialized successfully"));

    // Generate filename with timestamp
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)) {
      char fname[32];
      strftime(fname, sizeof(fname), "/%Y%m%d_%H%M%S.jpg", &timeinfo);
      filename = String(fname);

      Serial.print(F("Attempting to create file: "));
      Serial.println(filename);
      Serial.flush();

      // Check if SD card is still mounted
      uint8_t cardType = SD_MMC.cardType();
      if (cardType == CARD_NONE) {
        Serial.println(F("ERROR: SD card no longer detected!"));
        addLog("ERROR", "SD card was unmounted");
        sd_card_available = false;
        esp_camera_fb_return(fb);
        return "";
      }

