cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
      // Try to open file with FILE_WRITE mode
      Serial.println(F("Opening file with FILE_WRITE..."));
      File file = SD_MMC.open(filename.c_str(), FILE_WRITE);
      if (!file) {
        // Try alternative: open with "w" mode
        Serial.println(F("FILE_WRITE failed, trying with fopen mode..."));
        file = SD_MMC.open(filename.c_str(), "w");
      }

      if (file) {
        Serial.println(F("File opened successfully, writing data..."));
        size_t written = file.write(fb->buf, fb->len);
        file.close();
        Serial.printf("Wrote %d bytes successfully\n", written);
        addLog("SUCCESS", "Photo saved: " + filename + " (" + String(written) + " bytes)");
      } else {
        Serial.println(F("ERROR: Failed to open file on SD card"));
        Serial.println(F("Trying to create test file to diagnose..."));

        // Diagnostic test
        File test = SD_MMC.open("/test2.txt", FILE_WRITE);
        if (test) {
          test.println("Test after photo attempt");
          test.close();
          Serial.println(F("Test file created OK - photo filename may be invalid"));
          SD_MMC.remove("/test2.txt");
        } else {
          Serial.println(F("Test file also failed - SD card has become read-only"));
        }

        addLog("ERROR", "Failed to open file on SD card: " + filename);
        filename = "";
      }
    } else {
      Serial.println(F("ERROR: Could not get local time for filename"));
      addLog("ERROR", "Could not get time for photo filename");
    }
  } else {
    Serial.println(F("ERROR: SD card not available"));
    addLog("ERROR", "SD card not available for photo storage");
  }

  esp_camera_fb_return(fb);
  return filename;
}
#else
// Stub functions when camera library is not available
bool initCamera() {
  addLog("INFO", "Camera library not available");
  return false;
}

String capturePhoto() {
  return "";
}
#endif

// ========================================
// SD CARD FUNCTIONS
// ========================================

#ifdef HAS_CAMERA_LIB
bool initSDCard() {
  if (board_type == BOARD_GENERIC) {
    Serial.println(F("SD card not available - board type is generic"));
    return false;
  }

  Serial.println(F("Initializing SD card..."));
  Serial.printf("DEBUG: board_type = %d (0=Generic, 1=SIM7670G, 2=Freenove)\n", board_type);

  // SD pins differ by board - set correct pins
  int sd_clk, sd_cmd, sd_data, sd_cd;
  if (board_type == BOARD_SIM7670G) {
    Serial.println(F("SD card pins (Waveshare): CLK=5, CMD=4, DATA=6"));
    sd_clk = SIM7670G_SD_CLK;
    sd_cmd = SIM7670G_SD_CMD;
    sd_data = SIM7670G_SD_DATA;
    sd_cd = SIM7670G_SD_CD;
  } else if (board_type == BOARD_FREENOVE_S3) {
    Serial.println(F("SD card pins (Freenove): CLK=39, CMD=38, DATA=40"));
    sd_clk = FREENOVE_SD_CLK;
    sd_cmd = FREENOVE_SD_CMD;
    sd_data = FREENOVE_SD_DATA;
    sd_cd = FREENOVE_SD_CD;
  } else {
    // Default to SIM7670G pins
    sd_clk = SD_MMC_CLK;
    sd_cmd = SD_MMC_CMD;
    sd_data = SD_MMC_DATA;
    sd_cd = SD_CD_PIN;
  }
  Serial.flush();

  // Check card detect pin if available
  if (sd_cd >= 0) {
    pinMode(sd_cd, INPUT_PULLUP);
    delay(100);
    int cardDetect = digitalRead(sd_cd);
    Serial.print(F("Card detect pin (GPIO "));
    Serial.print(sd_cd);
    Serial.print(F(") state: "));
    Serial.print(cardDetect);
    Serial.print(F(" ("));
    Serial.print(cardDetect == LOW ? "LOW - Card present?" : "HIGH - No card?");
    Serial.println(F(")"));
    Serial.println(F("NOTE: Card detect is optional - SD_MMC.begin() will try anyway"));
    Serial.flush();
  } else {
    Serial.println(F("No card detect pin - skipping card detect check"));
  }

  // Give SD card time to power up
  delay(500);

  // Try to initialize SD card in 1-bit mode
  Serial.println(F("Attempting SD_MMC.begin() in 1-bit mode..."));
  Serial.flush();

  // Method 1: Try SD_MMC (SDMMC peripheral - faster but less compatible)
  Serial.println(F("Method 1: Trying SD_MMC library..."));
  Serial.printf("DEBUG: board_type=%d, BOARD_FREENOVE_S3=%d\n", board_type, BOARD_FREENOVE_S3);
  Serial.flush();

  bool sdmmc_success = false;

  // Freenove uses default SDMMC pins, try without setPins first
  if (board_type == BOARD_FREENOVE_S3) {
    Serial.println(F("DEBUG: Freenove board detected, trying default pins"));
    Serial.println(F("  Trying default SDMMC pins (Freenove uses hardware defaults)..."));
    if (SD_MMC.begin("/sdcard", true)) {
      sdmmc_success = true;
      Serial.println(F("  SD_MMC 1-bit mode SUCCESS with default pins!"));
    } else {
      Serial.println(F("  Default pins failed, trying setPins()..."));
    }
  }

  // If not Freenove or default pins failed, try with explicit setPins
  if (!sdmmc_success) {
    Serial.printf("Setting SD pins: CLK=%d, CMD=%d, DATA=%d\n", sd_clk, sd_cmd, sd_data);
    if (!SD_MMC.setPins(sd_clk, sd_cmd, sd_data)) {
      Serial.println(F("WARNING: setPins() failed or not supported"));
    }
    Serial.flush();

    // Try 1-bit mode
    Serial.println(F("  Trying 1-bit mode..."));
    if (SD_MMC.begin("/sdcard", true)) {
      sdmmc_success = true;
      Serial.println(F("  SD_MMC 1-bit mode SUCCESS!"));
    } else {
      Serial.println(F("  1-bit mode failed, trying 4-bit..."));
      SD_MMC.end();
      delay(500);

      // Try 4-bit mode
      if (SD_MMC.begin("/sdcard", false)) {
        sdmmc_success = true;
        Serial.println(F("  SD_MMC 4-bit mode SUCCESS!"));
      } else {
        Serial.println(F("  SD_MMC failed in both modes"));
        SD_MMC.end();
      }
    }
  }

  // Method 2: If SD_MMC failed, try SPI mode with SD library
  if (!sdmmc_success) {
    Serial.println(F("Method 2: Trying SD library (SPI mode)..."));
    Serial.println(F("NOTE: SPI mode uses different pins - this may not work on this board"));
    Serial.flush();

    // Use default SPI pins or try to use the SDMMC pins as SPI
    // Note: This likely won't work as the hardware is designed for SDMMC mode
    if (SD.begin(SD_MMC_CMD)) {  // Use CMD pin as CS
      Serial.println(F("  SD SPI mode SUCCESS!"));
      sd_card_available = true;

