cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
      uint64_t cardSize = SD.cardSize() / (1024 * 1024);
      Serial.print(F("SD card (SPI mode) - Size: "));
      Serial.print((uint32_t)cardSize);
      Serial.println(F(" MB"));
      return true;
    } else {
      Serial.println(F("  SD SPI mode failed"));
      Serial.println(F(""));
      Serial.println(F("SD card initialization FAILED in all modes:"));
      Serial.println(F("  - SD_MMC 1-bit mode: FAILED"));
      Serial.println(F("  - SD_MMC 4-bit mode: FAILED"));
      Serial.println(F("  - SD SPI mode: FAILED"));
      Serial.println(F(""));
      Serial.println(F("This indicates a hardware issue with the SD slot"));
      sd_card_available = false;
      return false;
    }
  }

  Serial.println(F("SD_MMC.begin() succeeded!"));
  Serial.flush();

  uint8_t cardType = SD_MMC.cardType();
  Serial.print(F("Card type: "));
  Serial.println(cardType);
  Serial.flush();

  if (cardType == CARD_NONE) {
    Serial.println(F("No SD card attached"));
    Serial.println(F("System will continue without SD card"));
    SD_MMC.end();  // Clean up
    sd_card_available = false;
    return false;
  }

  // Get card size safely
  uint64_t cardSize = 0;
  if (cardType != CARD_NONE) {
    cardSize = SD_MMC.cardSize() / (1024 * 1024);
  }

  Serial.print(F("SD card initialized - Size: "));
  Serial.print((uint32_t)cardSize);
  Serial.println(F(" MB"));

  // Test write capability
  Serial.println(F("Testing SD card write capability..."));
  File testFile = SD_MMC.open("/test.txt", FILE_WRITE);
  if (testFile) {
    testFile.println("SD card write test");
    testFile.close();
    Serial.println(F("Write test SUCCESS - SD card is writable"));
    SD_MMC.remove("/test.txt");  // Clean up test file
    addLog("SUCCESS", "SD card initialized - Size: " + String((uint32_t)cardSize) + " MB");
    sd_card_available = true;
    return true;
  } else {
    Serial.println(F("Write test FAILED - SD card is READ-ONLY or write-protected"));
    Serial.println(F("Check: Physical write-protect switch on SD card"));
    addLog("ERROR", "SD card is read-only or write-protected");
    sd_card_available = false;
    return false;
  }
}
#else
// Stub function when camera library (with SD_MMC) is not available
bool initSDCard() {
  Serial.println(F("SD card library not available"));
  return false;
}
#endif

// ========================================
// CELLULAR MODEM FUNCTIONS
// ========================================

String sendATCommand(String command, unsigned long timeout = 1000) {
  if (ModemSerial == nullptr) return "ERROR: Modem not initialized";

  // Clear any pending data
  while (ModemSerial->available()) {
    ModemSerial->read();
  }

  // Send command character-by-character with delays (like Waveshare example)
  // This is CRITICAL for SIM7670G modem to properly receive commands
  for (size_t i = 0; i < command.length(); i++) {
    ModemSerial->write(command[i]);
    delay(10);
  }

  // Send line ending
  ModemSerial->write('\r');
  delay(10);
  ModemSerial->write('\n');
  delay(10);
  ModemSerial->flush();

  String response = "";
  unsigned long startTime = millis();
  bool gotResponse = false;

  while (millis() - startTime < timeout) {
    if (ModemSerial->available()) {
      char c = ModemSerial->read();
      response += c;
      gotResponse = true;
    }
    // Check for completion
    if (response.indexOf("OK") >= 0 || response.indexOf("ERROR") >= 0) {
      break;
    }
    // Small delay to allow data to arrive
    if (!gotResponse) {
      delay(10);
    }
  }

  // Debug output
  Serial.print(F("AT: "));
  Serial.print(command);
  Serial.print(F(" -> ["));
  Serial.print(response.length());
  Serial.print(F(" bytes] "));
  if (response.length() > 0) {
    // Print first 100 chars of response
    Serial.println(response.length() > 100 ? response.substring(0, 100) + "..." : response);
  } else {
    Serial.println(F("(empty)"));
  }

  return response;
}

bool initModem() {
  Serial.println(F("[MODEM] initModem() called"));
  Serial.flush();

  if (board_type != BOARD_SIM7670G) {
    Serial.println(F("[MODEM] Board is not SIM7670G, skipping"));
    Serial.flush();
    addLog("INFO", "Cellular modem not available - board type is generic");
    return false;
  }

  // Initialize modem serial object if not already done
  Serial.println(F("[MODEM] Creating HardwareSerial object..."));
  Serial.flush();
  if (ModemSerial == nullptr) {
    ModemSerial = new HardwareSerial(2);  // UART2
    Serial.println(F("[MODEM] HardwareSerial created"));
    Serial.flush();
  }

  // CRITICAL: Enable modem power (pin 33 must be HIGH) - like Waveshare example
  Serial.println(F("[MODEM] Enabling modem power on pin 33..."));
  Serial.flush();
  pinMode(MODEM_PWR_EN_PIN, OUTPUT);
  digitalWrite(MODEM_PWR_EN_PIN, HIGH);
  Serial.println(F("[MODEM] Pin 33 set HIGH - modem power enabled"));
  Serial.flush();

  // Initialize modem serial BEFORE power sequence
  // NOTE: In HardwareSerial, the parameter order is: baud, mode, rxPin, txPin (ESP32 perspective)
  // ESP32 RX=17 connects to Modem TX
  // ESP32 TX=18 connects to Modem RX
  // Our pin names are from MODEM perspective, so we need to swap them!
  Serial.printf("[MODEM] Initializing serial: ESP32 RX=17 (modem TX), ESP32 TX=18 (modem RX) at 115200 baud...\n");
  Serial.flush();
  ModemSerial->begin(115200, SERIAL_8N1, MODEM_TX_PIN, MODEM_RX_PIN);  // Swapped because pin names are from modem perspective!
  delay(100);
  Serial.println(F("[MODEM] Serial port opened"));
  Serial.flush();

  // Give modem time to power up after enabling pin 33
  Serial.println(F("[MODEM] Waiting for modem to power up..."));
  Serial.flush();
  delay(3000);  // Wait for modem to stabilize
  Serial.println(F("[MODEM] Power-up wait complete"));
  Serial.flush();

  // Test AT communication with multiple attempts and diagnostics
  Serial.println(F("[MODEM] Testing AT communication..."));
  Serial.flush();

  // First check if modem is sending anything
  Serial.println(F("[MODEM] Checking for any data from modem..."));
  delay(500);
  if (ModemSerial->available()) {
    Serial.print(F("[MODEM] Data available: "));
    while (ModemSerial->available()) {
      Serial.write(ModemSerial->read());
    }
    Serial.println();
  } else {
    Serial.println(F("[MODEM] No data from modem (yet)"));
  }
  Serial.flush();

