cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  bool modemResponded = false;

  for (int i = 0; i < 5 && !modemResponded; i++) {
    Serial.printf("[MODEM] AT test attempt %d/5\n", i + 1);
    Serial.flush();

    String response = sendATCommand("AT", 2000);  // Longer timeout
    if (response.indexOf("OK") >= 0 || response.indexOf("AT") >= 0) {
      Serial.println(F("[MODEM] Modem responded!"));
      Serial.flush();
      addLog("SUCCESS", "Modem initialized");
      modemResponded = true;

      // Send AT again to stabilize
      sendATCommand("AT");
      delay(100);

      // Configure modem
      Serial.println(F("[MODEM] Configuring modem..."));
      Serial.flush();
      sendATCommand("ATE0");  // Echo off
      delay(100);
      sendATCommand("AT+CMEE=2");  // Verbose error messages
      delay(100);

      // Get modem information for diagnostics
      String modelResponse = sendATCommand("AT+CGMM");
      if (modelResponse.indexOf("OK") >= 0) {
        int start = modelResponse.indexOf("\n") + 1;
        int end = modelResponse.indexOf("\r", start);
        if (start > 0 && end > start) {
          modem_model = modelResponse.substring(start, end);
          modem_model.trim();
        }
      }

      String imeiResponse = sendATCommand("AT+CGSN");
      if (imeiResponse.indexOf("OK") >= 0) {
        int start = imeiResponse.indexOf("\n") + 1;
        int end = imeiResponse.indexOf("\r", start);
        if (start > 0 && end > start) {
          modem_imei = imeiResponse.substring(start, end);
          modem_imei.trim();
        }
      }

      String iccidResponse = sendATCommand("AT+CCID");
      if (iccidResponse.indexOf("+CCID:") >= 0) {
        int start = iccidResponse.indexOf(":") + 2;
        int end = iccidResponse.indexOf("\r", start);
        if (start > 1 && end > start) {
          modem_iccid = iccidResponse.substring(start, end);
          modem_iccid.trim();
        }
      }

      Serial.println(F("[MODEM] Configuration complete"));
      Serial.flush();
      modem_initialized = true;

      return true;
    }
    delay(1000);
  }

  // If normal configuration didn't work, try different baud rates
  if (!modemResponded) {
    Serial.println(F("[MODEM] Standard 115200 baud failed, trying other baud rates..."));
    Serial.flush();

    // Common modem baud rates to try
    uint32_t baudRates[] = {9600, 19200, 38400, 57600, 115200, 460800, 921600};

    for (int b = 0; b < 7 && !modemResponded; b++) {
      if (baudRates[b] == 115200) continue;  // Already tried this one

      Serial.printf("[MODEM] Trying baud rate: %d\n", baudRates[b]);
      ModemSerial->end();
      delay(100);
      ModemSerial->begin(baudRates[b], SERIAL_8N1, MODEM_TX_PIN, MODEM_RX_PIN);
      delay(500);

      for (int i = 0; i < 2 && !modemResponded; i++) {
        String response = sendATCommand("AT", 2000);
        if (response.indexOf("OK") >= 0 || response.indexOf("AT") >= 0) {
          Serial.printf("[MODEM] SUCCESS at %d baud!\n", baudRates[b]);
          addLog("SUCCESS", String("Modem initialized at ") + String(baudRates[b]) + " baud");
          modemResponded = true;
          break;
        }
        delay(500);
      }
    }
  }

  if (!modemResponded) {
    Serial.println(F("[MODEM] Failed to get AT response at any baud rate"));
    Serial.flush();
    addLog("ERROR", "Modem initialization failed - no response at any baud rate");
    return false;
  }

  // If we got here with modemResponded = true (from swapped pins), configure the modem
  Serial.println(F("[MODEM] Configuring modem..."));
  Serial.flush();

  sendATCommand("AT");
  delay(100);
  sendATCommand("ATE0");  // Echo off
  delay(100);
  sendATCommand("AT+CMEE=2");  // Verbose error messages
  delay(100);

  // Get modem information for diagnostics
  String modelResponse = sendATCommand("AT+CGMM");
  if (modelResponse.indexOf("OK") >= 0) {
    int start = modelResponse.indexOf("\n") + 1;
    int end = modelResponse.indexOf("\r", start);
    if (start > 0 && end > start) {
      modem_model = modelResponse.substring(start, end);
      modem_model.trim();
    }
  }

  String imeiResponse = sendATCommand("AT+CGSN");
  if (imeiResponse.indexOf("OK") >= 0) {
    int start = imeiResponse.indexOf("\n") + 1;
    int end = imeiResponse.indexOf("\r", start);
    if (start > 0 && end > start) {
      modem_imei = imeiResponse.substring(start, end);
      modem_imei.trim();
    }
  }

  String iccidResponse = sendATCommand("AT+CCID");
  if (iccidResponse.indexOf("+CCID:") >= 0) {
    int start = iccidResponse.indexOf(":") + 2;
    int end = iccidResponse.indexOf("\r", start);
    if (start > 1 && end > start) {
      modem_iccid = iccidResponse.substring(start, end);
      modem_iccid.trim();
    }
  }

  Serial.println(F("[MODEM] Configuration complete"));
  Serial.flush();
  modem_initialized = true;

  return true;
}

bool connectCellular() {
  if (!cellular_enabled || board_type != BOARD_SIM7670G) {
    return false;
  }

  Serial.println(F("Connecting to cellular network..."));
  addLog("INFO", "Connecting to cellular network");

  // Check SIM card - give modem extra time to detect it
  Serial.println(F("[CELLULAR] Checking SIM card status..."));
  delay(2000);  // Wait for SIM to be detected

  String response = sendATCommand("AT+CPIN?", 3000);

  // Print detailed SIM status
  Serial.print(F("[CELLULAR] SIM Status Response: "));
  Serial.println(response);

  if (response.indexOf("READY") >= 0) {
    Serial.println(F("[CELLULAR] SIM card is READY"));
  } else if (response.indexOf("SIM PIN") >= 0) {
    Serial.println(F("[CELLULAR] SIM card requires PIN"));
    addLog("ERROR", "SIM requires PIN code");
    return false;
  } else if (response.indexOf("SIM PUK") >= 0) {
    Serial.println(F("[CELLULAR] SIM card is PUK locked"));
    addLog("ERROR", "SIM is PUK locked");
    return false;
  } else if (response.indexOf("NOT INSERTED") >= 0 || response.indexOf("NOT READY") >= 0) {
    Serial.println(F("[CELLULAR] SIM card not detected"));
    addLog("ERROR", "No SIM card detected");
    return false;
  } else {
    Serial.println(F("[CELLULAR] Unknown SIM status - may not be ready yet"));
    addLog("ERROR", "SIM card not ready");
    return false;
  }

  // Wait for network registration
  for (int i = 0; i < 30; i++) {
    response = sendATCommand("AT+CREG?");
    if (response.indexOf("+CREG: 0,1") >= 0 || response.indexOf("+CREG: 0,5") >= 0) {
      Serial.println(F("Network registered!"));
      break;
    }
    delay(1000);
    esp_task_wdt_reset();
  }

  // Get operator name
  response = sendATCommand("AT+COPS?");
  int opStart = response.indexOf("\",\"") + 3;
  int opEnd = response.indexOf("\"", opStart);
  if (opStart > 2 && opEnd > opStart) {
    cellular_operator = response.substring(opStart, opEnd);
  }

  // Get signal strength
  response = sendATCommand("AT+CSQ");
  int rssiStart = response.indexOf(": ") + 2;
  int rssiEnd = response.indexOf(",", rssiStart);
  if (rssiStart > 1 && rssiEnd > rssiStart) {
    cellular_signal_strength = response.substring(rssiStart, rssiEnd).toInt();
  }

  // Get network type (2G/3G/4G)
  response = sendATCommand("AT+CPSI?");
  if (response.indexOf("LTE") >= 0) {
    modem_network_type = "4G LTE";
  } else if (response.indexOf("WCDMA") >= 0 || response.indexOf("HSDPA") >= 0) {
    modem_network_type = "3G";
  } else if (response.indexOf("GSM") >= 0 || response.indexOf("GPRS") >= 0) {
    modem_network_type = "2G";
  } else {
    modem_network_type = "Unknown";
  }

