cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  // Configure APN
  if (apn.length() > 0) {
    sendATCommand("AT+CGDCONT=1,\"IP\",\"" + apn + "\"");
  }

  // Activate PDP context
  response = sendATCommand("AT+CGACT=1,1", 5000);
  if (response.indexOf("OK") >= 0) {
    cellular_connected = true;
    addLog("SUCCESS", "Cellular connected - " + cellular_operator + " (RSSI: " + String(cellular_signal_strength) + ")");
    Serial.println(F("Cellular network connected!"));
    return true;
  }

  addLog("ERROR", "Cellular connection failed");
  return false;
}

bool sendSMS(String phoneNumber, String message) {
  if (!cellular_connected) {
    addLog("ERROR", "SMS: No cellular connection");
    return false;
  }

  Serial.println(F("Sending SMS..."));

  // Set SMS text mode
  sendATCommand("AT+CMGF=1");

  // Set recipient
  ModemSerial->print("AT+CMGS=\"");
  ModemSerial->print(phoneNumber);
  ModemSerial->println("\"");
  delay(500);

  // Send message
  ModemSerial->print(message);
  ModemSerial->write(26);  // Ctrl+Z to send

  String response = "";
  unsigned long startTime = millis();
  while (millis() - startTime < 10000) {
    if (ModemSerial->available()) {
      response += (char)ModemSerial->read();
    }
    if (response.indexOf("OK") >= 0) {
      Serial.println(F("✓ SMS sent"));
      addLog("SUCCESS", "SMS sent to " + phoneNumber);
      return true;
    }
    if (response.indexOf("ERROR") >= 0) {
      break;
    }
  }

  Serial.println(F("✗ SMS failed"));
  addLog("ERROR", "SMS send failed");
  return false;
}

String sendHTTPRequest(String url, String method, String payload, String contentType) {
  if (!cellular_connected) {
    addLog("ERROR", "HTTP: No cellular connection");
    return "";
  }

  Serial.print(F("HTTP "));
  Serial.print(method);
  Serial.print(F(" via cellular: "));
  Serial.println(url);

  // Initialize HTTP
  sendATCommand("AT+HTTPTERM");  // Terminate any existing session
  delay(500);
  sendATCommand("AT+HTTPINIT");

  // Set parameters
  sendATCommand("AT+HTTPPARA=\"URL\",\"" + url + "\"");
  sendATCommand("AT+HTTPPARA=\"CONTENT\",\"" + contentType + "\"");

  int action = 0;  // GET
  if (method == "POST") {
    action = 1;
    // Send data
    sendATCommand("AT+HTTPDATA=" + String(payload.length()) + ",10000");
    delay(500);
    ModemSerial->print(payload);
    delay(1000);
  }

  // Execute request
  String response = sendATCommand("AT+HTTPACTION=" + String(action), 15000);
  delay(2000);

  // Read response
  response = sendATCommand("AT+HTTPREAD", 5000);

  // Terminate HTTP
  sendATCommand("AT+HTTPTERM");

  return response;
}

// ========================================
// GPS FUNCTIONS
// ========================================

#ifdef HAS_GPS_LIB
bool initGPS() {
  if (board_type != BOARD_SIM7670G || !cellular_enabled) {
    addLog("INFO", "GPS not available - board type is generic or modem not enabled");
    return false;
  }

  // Initialize GPS object if needed
  if (gps == nullptr) {
    gps = new TinyGPSPlus();
  }

  // Enable GNSS power
  sendATCommand("AT+CGNSPWR=1");
  addLog("INFO", "GPS initialized via modem");
  return true;
}

void updateGPS() {
  // GPS data is retrieved on-demand via AT commands
  // No continuous update needed
}

String getGPSLocation() {
  if (!gps_enabled || board_type != BOARD_SIM7670G || !cellular_enabled) {
    return "";
  }

  // Get GPS info from modem
  String response = sendATCommand("AT+CGNSINF");

  // Parse response: +CGNSINF: <GNSS run status>,<Fix status>,<UTC date & Time>,
  //                  <Latitude>,<Longitude>,<MSL Altitude>,<Speed Over Ground>,
  //                  <Course Over Ground>,<Fix Mode>,<Reserved1>,<HDOP>,<PDOP>,
  //                  <VDOP>,<Reserved2>,<GPS Satellites in View>,<GNSS Satellites Used>,
  //                  <GLONASS Satellites in View>,<Reserved3>,<C/N0 max>,<HPA>,<VPA>

  int infoStart = response.indexOf("+CGNSINF: ") + 10;
  if (infoStart < 10) return "GPS: No data";

  String info = response.substring(infoStart);
  int commas[25];
  int commaCount = 0;

  // Find all comma positions
  for (int i = 0; i < info.length() && commaCount < 25; i++) {
    if (info[i] == ',') {
      commas[commaCount++] = i;
    }
  }

  if (commaCount < 14) return "GPS: Parse error";

  // Extract fix status (field 1)
  String fixStatus = info.substring(commas[0] + 1, commas[1]);
  if (fixStatus != "1") {
    return "GPS: No fix";
  }

  // Extract latitude (field 3)
  String lat = info.substring(commas[2] + 1, commas[3]);
  // Extract longitude (field 4)
  String lon = info.substring(commas[3] + 1, commas[4]);
  // Extract altitude (field 5)
  String alt = info.substring(commas[4] + 1, commas[5]);
  // Extract satellites used (field 15)
  String sats = info.substring(commas[14] + 1, commas[15]);

  if (lat.length() == 0 || lon.length() == 0) {
    return "GPS: No fix";
  }

  String loc = "Lat: " + lat + ", Lon: " + lon;
  if (alt.length() > 0 && alt != "0") {
    loc += ", Alt: " + alt + "m";
  }
  if (sats.length() > 0) {
    loc += " (" + sats + " sats)";
  }

  return loc;
}
#else
// Stub functions when GPS library is not available
bool initGPS() {
  addLog("INFO", "GPS library not available");
  return false;
}

void updateGPS() {
  // No-op
}

String getGPSLocation() {
  return "";
}
#endif

// ========================================
// BMP180 SENSOR FUNCTIONS
// ========================================

#ifdef HAS_BMP180_LIB
bool initBMP180() {
  if (!bmp180_enabled) {
    addLog("INFO", "BMP180 sensor disabled");
    return false;
  }

  Serial.println(F("Initializing BMP180 sensor..."));
  Serial.printf("I2C pins - SDA: GPIO%d, SCL: GPIO%d\n", bmp180_sda_pin, bmp180_scl_pin);

  // Initialize I2C with custom pins
  Wire.begin(bmp180_sda_pin, bmp180_scl_pin);
  delay(100);

  // Initialize BMP180 object if needed
  if (bmp == nullptr) {
    bmp = new Adafruit_BMP085();
  }

  // Try to initialize the sensor
  if (!bmp->begin()) {
    Serial.println(F("ERROR: Could not find BMP180 sensor!"));
    Serial.println(F("Check wiring:"));
    Serial.printf("  VCC -> 3.3V\n");
    Serial.printf("  GND -> GND\n");
    Serial.printf("  SDA -> GPIO%d\n", bmp180_sda_pin);
    Serial.printf("  SCL -> GPIO%d\n", bmp180_scl_pin);
    addLog("ERROR", "BMP180 sensor not found - check wiring");
    bmp180_initialized = false;
    return false;
  }

  Serial.println(F("✓ BMP180 sensor initialized successfully"));
  addLog("SUCCESS", "BMP180 sensor initialized");
  bmp180_initialized = true;

  // Read initial values
  updateBMP180();

