cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  return true;
}

void updateBMP180() {
  if (!bmp180_initialized || !bmp180_enabled || bmp == nullptr) {
    return;
  }

  // Read temperature in Celsius
  last_temperature = bmp->readTemperature();

  // Read pressure in Pascals (convert to hPa/mbar)
  last_pressure = bmp->readPressure() / 100.0;

  // Calculate altitude (meters) based on standard atmospheric pressure
  last_altitude = bmp->readAltitude();

  // Optional: Print to serial for debugging
  // Serial.printf("BMP180 - Temp: %.1f°C, Pressure: %.1f hPa, Alt: %.1f m\n",
  //               last_temperature, last_pressure, last_altitude);
}

String getBMP180Data() {
  if (!bmp180_initialized || !bmp180_enabled) {
    return "";
  }

  // Update readings
  updateBMP180();

  String data = "";
  data += "Temperature: " + String(last_temperature, 1) + "°C";
  data += ", Pressure: " + String(last_pressure, 1) + " hPa";
  data += ", Altitude: " + String(last_altitude, 1) + " m";

  return data;
}

String getBMP180DataFormatted() {
  if (!bmp180_initialized || !bmp180_enabled) {
    return "";
  }

  // Update readings
  updateBMP180();

  String data = "\n🌡️  Temperature: " + String(last_temperature, 1) + "°C / " + String(last_temperature * 9.0 / 5.0 + 32.0, 1) + "°F";
  data += "\n🔽 Pressure: " + String(last_pressure, 1) + " hPa / " + String(last_pressure * 0.02953, 2) + " inHg";
  data += "\n⛰️  Altitude: " + String(last_altitude, 1) + " m / " + String(last_altitude * 3.28084, 1) + " ft";

  return data;
}

#else
// Stub functions when BMP180 library is not available
bool initBMP180() {
  addLog("INFO", "BMP180 library not available");
  return false;
}

void updateBMP180() {
  // No-op
}

String getBMP180Data() {
  return "";
}

String getBMP180DataFormatted() {
  return "";
}
#endif

void setup() {
  Serial.begin(115200);
  delay(1000);  // Give serial time to initialize
  Serial.println(F("\n\n=== ESP32-Notifier v" VERSION " ==="));
  Serial.println(F("[BOOT] Serial initialized"));
  Serial.flush();

  // Print memory before anything else
  Serial.printf("[BOOT] Free Heap: %d bytes\n", ESP.getFreeHeap());
  Serial.printf("[BOOT] Chip: %s Rev %d\n", ESP.getChipModel(), ESP.getChipRevision());
  Serial.flush();

  // Enable watchdog timer with compatibility for different ESP32 core versions
  Serial.println(F("[BOOT] Initializing watchdog..."));
  Serial.flush();
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // ESP32 Arduino Core 3.x
    esp_task_wdt_deinit();  // Deinitialize if already initialized
    esp_task_wdt_config_t wdt_config = {
      .timeout_ms = WDT_TIMEOUT * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    esp_task_wdt_init(&wdt_config);
    esp_task_wdt_add(NULL);
  #else
    // ESP32 Arduino Core 2.x
    esp_task_wdt_init(WDT_TIMEOUT, true);
    esp_task_wdt_add(NULL);
  #endif
  Serial.println(F("[BOOT] Watchdog timer enabled (30s)"));
  Serial.flush();

  Serial.println(F("[BOOT] Loading preferences..."));
  Serial.flush();
  loadPreferences();
  Serial.println(F("[BOOT] Preferences loaded OK"));
  Serial.flush();
  delay(100);

  // Initialize board-specific features
  Serial.println(F("[BOOT] Checking board configuration..."));
  Serial.flush();
  delay(100);

  Serial.print(F("[BOOT] Board type: "));
  Serial.print(board_type);
  Serial.println(F(" (0=Generic, 1=SIM7670G)"));
  Serial.flush();
  delay(100);

  Serial.print(F("[BOOT] Cellular enabled: "));
  Serial.print(cellular_enabled);
  Serial.print(F(", Camera: "));
  Serial.print(camera_enabled);
  Serial.print(F(", GPS: "));
  Serial.println(gps_enabled);
  Serial.flush();
  delay(100);

  if (board_type == BOARD_SIM7670G) {
    Serial.println(F("[BOOT] Board: ESP32-S3-SIM7670G-4G (Waveshare)"));
    Serial.flush();
    addLog("INFO", "Board type: ESP32-S3-SIM7670G-4G (Waveshare)");

    // Initialize cellular modem first if enabled
    // Uses UART on pins 17 (TX) and 18 (RX) based on Waveshare examples
    if (cellular_enabled) {
      Serial.println(F("[BOOT] Initializing cellular modem..."));
      Serial.flush();
      esp_task_wdt_reset();  // Reset watchdog before modem init

      if (initModem()) {
        Serial.println(F("[BOOT] Modem initialized successfully"));
        Serial.flush();

        // Try to connect to cellular network
        if (connectCellular()) {
          Serial.println(F("[BOOT] Cellular network connected"));
          Serial.flush();
        } else {
          Serial.println(F("[BOOT] Cellular connection failed - continuing without cellular"));
          Serial.flush();
        }
      } else {
        Serial.println(F("[BOOT] Modem initialization failed - continuing without cellular"));
        Serial.flush();
      }
    } else {
      Serial.println(F("[BOOT] Cellular disabled, skipping modem"));
      Serial.flush();
    }

    // Initialize SD card
    Serial.println(F("[BOOT] Initializing SD card..."));
    Serial.flush();
    esp_task_wdt_reset();  // Reset watchdog before SD card init
    if (initSDCard()) {
      Serial.println(F("[BOOT] SD card ready"));
      Serial.flush();
    } else {
      Serial.println(F("[BOOT] SD card init failed - continuing without SD"));
      Serial.flush();
    }

    // Initialize camera if enabled
    if (camera_enabled) {
      Serial.println(F("[BOOT] Initializing camera..."));
      Serial.flush();
      esp_task_wdt_reset();  // Reset watchdog before camera init
      if (initCamera()) {
        Serial.println(F("[BOOT] Camera ready"));
        Serial.flush();

        // Camera initialization may affect SD_MMC - verify SD card is still accessible
        Serial.println(F("[BOOT] Verifying SD card after camera init..."));
        uint8_t cardType = SD_MMC.cardType();
        if (cardType == CARD_NONE) {
          Serial.println(F("[BOOT] WARNING: SD card unmounted after camera init"));
          Serial.println(F("[BOOT] Reinitializing SD card..."));
          // Try to reinit SD card
          if (initSDCard()) {
            Serial.println(F("[BOOT] SD card reinitialized successfully"));
          } else {
            Serial.println(F("[BOOT] SD card reinit failed - camera and SD may conflict"));
          }
        } else {
          Serial.println(F("[BOOT] SD card still accessible after camera init"));
        }
      } else {
        Serial.println(F("[BOOT] Camera init failed"));
        Serial.flush();
      }
    } else {
      Serial.println(F("[BOOT] Camera disabled, skipping"));
      Serial.flush();
    }

