cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
    // Initialize GPS if enabled (requires modem)
    if (gps_enabled && cellular_enabled) {
      Serial.println(F("[BOOT] Initializing GPS..."));
      Serial.flush();
      esp_task_wdt_reset();  // Reset watchdog before GPS init
      if (initGPS()) {
        Serial.println(F("[BOOT] GPS ready"));
        Serial.flush();
      } else {
        Serial.println(F("[BOOT] GPS init failed"));
        Serial.flush();
      }
    } else {
      Serial.println(F("[BOOT] GPS disabled or no cellular, skipping"));
      Serial.flush();
    }
  } else if (board_type == BOARD_FREENOVE_S3) {
    Serial.println(F("[BOOT] Board: Freenove ESP32-S3 CAM"));
    Serial.flush();
    addLog("INFO", "Board type: Freenove ESP32-S3 CAM");

    // Freenove board has camera and SD card but no cellular modem
    // Initialize SD card if camera is enabled
    if (camera_enabled) {
      Serial.println(F("[BOOT] Initializing SD card..."));
      Serial.flush();
      esp_task_wdt_reset();  // Reset watchdog
      if (initSDCard()) {
        Serial.println(F("[BOOT] SD card mounted"));
        Serial.flush();
      } else {
        Serial.println(F("[BOOT] SD card init failed - continuing without SD"));
        Serial.flush();
      }

      // Initialize camera
      Serial.println(F("[BOOT] Initializing camera..."));
      Serial.flush();
      esp_task_wdt_reset();  // Reset watchdog before camera init
      if (initCamera()) {
        Serial.println(F("[BOOT] Camera ready"));
        Serial.flush();

        // Verify SD card after camera init
        #ifdef HAS_CAMERA_LIB
        Serial.println(F("[BOOT] Verifying SD card after camera init..."));
        uint8_t cardType = SD_MMC.cardType();
        if (cardType == CARD_NONE) {
          Serial.println(F("[BOOT] WARNING: SD card unmounted after camera init"));
          Serial.println(F("[BOOT] Reinitializing SD card..."));
          if (initSDCard()) {
            Serial.println(F("[BOOT] SD card reinitialized successfully"));
          } else {
            Serial.println(F("[BOOT] SD card reinit failed"));
          }
        } else {
          Serial.println(F("[BOOT] SD card still accessible after camera init"));
        }
        #endif
      } else {
        Serial.println(F("[BOOT] Camera init failed"));
        Serial.flush();
      }
    } else {
      Serial.println(F("[BOOT] Camera disabled, skipping"));
      Serial.flush();
    }
  } else {
    Serial.println(F("[BOOT] Board: Generic ESP32-S3"));
    Serial.flush();
    addLog("INFO", "Board type: Generic ESP32-S3");
  }

  // Initialize BMP180 sensor if enabled (works on all board types)
  if (bmp180_enabled) {
    Serial.println(F("[BOOT] Initializing BMP180 sensor..."));
    Serial.flush();
    esp_task_wdt_reset();  // Reset watchdog before sensor init
    if (initBMP180()) {
      Serial.println(F("[BOOT] BMP180 sensor ready"));
      Serial.flush();
    } else {
      Serial.println(F("[BOOT] BMP180 sensor init failed - continuing without sensor"));
      Serial.flush();
    }
  } else {
    Serial.println(F("[BOOT] BMP180 sensor disabled, skipping"));
    Serial.flush();
  }

  // Configure enabled input pins
  Serial.println(F("[BOOT] Configuring input pins..."));
  Serial.flush();
  for (int i = 0; i < MAX_INPUTS; i++) {
    if (inputs[i].enabled) {
      pinMode(inputs[i].pin, INPUT_PULLDOWN);
      inputs[i].lastState = digitalRead(inputs[i].pin);
      Serial.print(F("[BOOT] Input "));
      Serial.print(i + 1);
      Serial.print(F(" ("));
      Serial.print(inputs[i].name);
      Serial.print(F(") on pin "));
      Serial.print(inputs[i].pin);
      Serial.print(F(": "));
      Serial.println(inputs[i].lastState ? F("HIGH") : F("LOW"));
      Serial.flush();
    }
  }

  // Check if WiFi credentials are configured
  Serial.println(F("[BOOT] Checking WiFi configuration..."));
  Serial.flush();
  if (wifi_ssid.length() == 0) {
    Serial.println(F("[BOOT] No WiFi credentials, starting AP mode"));
    Serial.flush();
    startAccessPoint();
    addLog("INFO", "Started in AP mode - no WiFi credentials");
  } else {
    Serial.printf("[BOOT] WiFi SSID configured: %s\n", wifi_ssid.c_str());
    Serial.flush();
    connectWiFiNonBlocking();
  }

  Serial.println(F("[BOOT] Setting up web server..."));
  Serial.flush();
  setupWebServer();
  server.begin();
  Serial.println(F("[BOOT] Web server started"));
  Serial.flush();

  Serial.printf("[BOOT] Free Heap at end: %d bytes\n", ESP.getFreeHeap());
  Serial.flush();
  addLog("INFO", "System started - ESP32-Notifier v" VERSION);
  Serial.println(F("[BOOT] === Setup complete ==="));
  Serial.flush();
}

void loop() {
  esp_task_wdt_reset();

  // Always handle web server (needed for AP mode)
  server.handleClient();

  if (apMode) {
    // In AP mode, just handle web requests for configuration
    return;
  }

  updateWiFiConnection();

  if (wifiState == WIFI_CONNECTED) {
    if (!timeIsSynced && millis() - lastTimeSyncAttempt > TIME_SYNC_RETRY) {
      attemptTimeSync();
    }

    checkAndReconnectWiFi();
    processRetryQueue();
  }

  // Update GPS data if enabled
  if (gps_enabled && board_type == BOARD_SIM7670G) {
    updateGPS();
  }

  // Update BMP180 sensor data if enabled
  // Read sensor every loop (sensor library handles timing internally)
  if (bmp180_enabled && bmp180_initialized) {
    updateBMP180();
  }

  // Monitor all enabled inputs
  for (int i = 0; i < MAX_INPUTS; i++) {
    if (inputs[i].enabled) {
      monitorInput(i);
    }
  }
}

void monitorInput(int index) {
  InputConfig &input = inputs[index];
  bool reading = digitalRead(input.pin);

  if (reading != input.currentState) {
    Serial.print(F("[INPUT] Pin "));
    Serial.print(input.pin);
    Serial.print(F(" changed to "));
    Serial.println(reading ? "HIGH" : "LOW");
    input.lastDebounceTime = millis();
    input.currentState = reading;
  }

  if ((millis() - input.lastDebounceTime) > DEBOUNCE_DELAY) {
    if (input.currentState != input.lastState) {
      Serial.print(F("[INPUT] State confirmed for "));
      Serial.print(input.name);
      Serial.print(F(" (pin "));
      Serial.print(input.pin);
      Serial.print(F("): "));
      Serial.println(input.currentState ? "HIGH" : "LOW");
      input.lastState = input.currentState;

      bool shouldNotify = false;
      String message;

