cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
      if (input.momentary_mode) {
        if (input.currentState == HIGH) {
          shouldNotify = true;
          message = input.message_on;
          Serial.print(input.name);
          Serial.println(F(" - Momentary trigger (HIGH)"));
        }
      } else {
        shouldNotify = true;
        message = input.currentState == HIGH ? input.message_on : input.message_off;
      }

      if (shouldNotify) {
        // Rate limiting
        if (millis() - input.lastNotificationTime >= MIN_NOTIFICATION_INTERVAL) {
          String timestamp = getFormattedTime();
          message.replace("{timestamp}", timestamp);

          // Capture photo if enabled for this input
          String photoFilename = "";
          if (input.capture_photo && camera_enabled && camera_initialized) {
            photoFilename = capturePhoto();
            if (photoFilename.length() > 0) {
              Serial.print(F("Photo captured: "));
              Serial.println(photoFilename);
            }
          }

          // Add GPS location if enabled for this input
          if (input.include_gps && gps_enabled) {
            String location = getGPSLocation();
            if (location.length() > 0) {
              message += "\n" + location;
            }
          }

          Serial.print(input.name);
          Serial.print(F(" state changed: "));
          Serial.println(message);

          addLog("INFO", "Trigger: " + input.name + " - " + (input.currentState == HIGH ? "HIGH" : "LOW"));
          sendNotifications(notification_title, message, photoFilename);
          input.lastNotificationTime = millis();
        } else {
          Serial.print(input.name);
          Serial.println(F(" - Notification rate limited"));
          addLog("WARNING", input.name + " notification rate limited");
        }
      }
    }
  }
}

void startAccessPoint() {
  Serial.println(F("Starting Access Point mode..."));
  WiFi.mode(WIFI_AP);
  WiFi.softAP(AP_SSID, AP_PASSWORD);
  IPAddress IP = WiFi.softAPIP();
  Serial.print(F("AP IP address: "));
  Serial.println(IP);
  Serial.print(F("AP SSID: "));
  Serial.println(AP_SSID);
  Serial.print(F("AP Password: "));
  Serial.println(AP_PASSWORD);
  apMode = true;
  wifiState = WIFI_CONNECTED;
}

void connectWiFiNonBlocking() {
  Serial.print(F("Connecting to WiFi: "));
  Serial.println(wifi_ssid);
  WiFi.mode(WIFI_STA);
  WiFi.begin(wifi_ssid.c_str(), wifi_password.c_str());
  wifiState = WIFI_CONNECTING;
  wifiConnectStart = millis();
  apMode = false;
}

void updateWiFiConnection() {
  if (apMode) return;  // Don't update WiFi state in AP mode
  if (wifiState == WIFI_CONNECTING) {
    if (WiFi.status() == WL_CONNECTED) {
      wifiState = WIFI_CONNECTED;
      Serial.println(F("\nWiFi connected!"));
      Serial.print(F("IP address: "));
      Serial.println(WiFi.localIP());
      addLog("SUCCESS", "WiFi connected - IP: " + WiFi.localIP().toString());
      attemptTimeSync();
    } else if (millis() - wifiConnectStart > WIFI_TIMEOUT) {
      wifiState = WIFI_FAILED;
      Serial.println(F("\nWiFi connection failed!"));
      addLog("ERROR", "WiFi connection timeout - falling back to AP mode");

      // Fall back to Access Point mode so user can reconfigure
      Serial.println(F("Falling back to Access Point mode..."));
      WiFi.disconnect();
      startAccessPoint();
    }
  }
}

void checkAndReconnectWiFi() {
  if (apMode) return;  // Don't try to reconnect in AP mode
  if (millis() - lastWiFiCheck < WIFI_CHECK_INTERVAL) return;
  lastWiFiCheck = millis();

  if (WiFi.status() != WL_CONNECTED && !wifiReconnecting) {
    wifiReconnecting = true;
    Serial.println(F("WiFi disconnected! Reconnecting..."));
    addLog("WARNING", "WiFi disconnected - attempting reconnection");

    WiFi.disconnect();
    connectWiFiNonBlocking();

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 20) {
      delay(500);
      Serial.print(F("."));
      attempts++;
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println(F("\nWiFi reconnected!"));
      addLog("SUCCESS", "WiFi reconnected successfully");
      configTime(gmt_offset, daylight_offset, ntpServer);
    } else {
      Serial.println(F("\nWiFi reconnection failed"));
    }

    wifiReconnecting = false;
  }
}

void attemptTimeSync() {
  lastTimeSyncAttempt = millis();
  configTime(gmt_offset, daylight_offset, ntpServer);

  struct tm timeinfo;
  if (getLocalTime(&timeinfo)) {
    timeIsSynced = true;
    Serial.println(F("Time synchronized!"));
  }
}

String getFormattedTime() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    return F("Time unavailable");
  }

  char timeString[50];
  strftime(timeString, sizeof(timeString), "%Y-%m-%d %H:%M:%S", &timeinfo);
  return String(timeString);
}

void loadPreferences() {
  Serial.println(F("[PREF] Opening preferences namespace..."));
  Serial.flush();
  preferences.begin("notifier", false);
  Serial.println(F("[PREF] Namespace opened"));
  Serial.flush();

  Serial.println(F("[PREF] Loading WiFi credentials..."));
  Serial.flush();
  wifi_ssid = preferences.getString(PrefKeys::WIFI_SSID, wifi_ssid);
  wifi_password = preferences.getString(PrefKeys::WIFI_PASS, wifi_password);
  web_username = preferences.getString(PrefKeys::WEB_USER, web_username);
  web_password = preferences.getString(PrefKeys::WEB_PASS, web_password);
  Serial.println(F("[PREF] WiFi credentials loaded"));
  Serial.flush();

  Serial.println(F("[PREF] Loading Pushbullet config..."));
  Serial.flush();
  pushbullet_token = preferences.getString(PrefKeys::PB_TOKEN, pushbullet_token);
  pushbullet_enabled = preferences.getBool(PrefKeys::PB_ENABLED, pushbullet_enabled);

  Serial.println(F("[PREF] Loading email config..."));
  Serial.flush();
  smtp_host = preferences.getString(PrefKeys::SMTP_HOST, smtp_host);
  smtp_port = preferences.getInt(PrefKeys::SMTP_PORT, smtp_port);
  smtp_email = preferences.getString(PrefKeys::SMTP_EMAIL, smtp_email);
  smtp_password = preferences.getString(PrefKeys::SMTP_PASS, smtp_password);
  recipient_email = preferences.getString(PrefKeys::RCPT_EMAIL, recipient_email);
  email_enabled = preferences.getBool(PrefKeys::EMAIL_ENABLED, email_enabled);

  Serial.println(F("[PREF] Loading Telegram config..."));
  Serial.flush();
  telegram_token = preferences.getString(PrefKeys::TG_TOKEN, telegram_token);
  telegram_chat_id = preferences.getString(PrefKeys::TG_CHAT, telegram_chat_id);
  telegram_enabled = preferences.getBool(PrefKeys::TG_ENABLED, telegram_enabled);

  Serial.println(F("[PREF] Loading notification settings..."));
  Serial.flush();
  notification_title = preferences.getString(PrefKeys::NOTIF_TITLE, notification_title);
  gmt_offset = preferences.getLong(PrefKeys::GMT_OFFSET, gmt_offset);
  daylight_offset = preferences.getInt(PrefKeys::DAY_OFFSET, daylight_offset);

  Serial.println(F("[PREF] Loading board configuration..."));
  Serial.flush();
  // NEW: Load board configuration
  board_type = preferences.getInt(PrefKeys::BOARD_TYPE, board_type);
  Serial.print(F("[PREF] Board type loaded: "));
  Serial.println(board_type);
  Serial.flush();

  camera_enabled = preferences.getBool(PrefKeys::CAMERA_EN, camera_enabled);
  gps_enabled = preferences.getBool(PrefKeys::GPS_EN, gps_enabled);

  Serial.println(F("[PREF] Loading cellular configuration..."));
  Serial.flush();
  // NEW: v3.1 Load cellular configuration
  cellular_enabled = preferences.getBool(PrefKeys::CELL_EN, cellular_enabled);
  apn = preferences.getString(PrefKeys::APN, apn);
  pushbullet_conn_mode = preferences.getInt(PrefKeys::PB_CONN_MODE, pushbullet_conn_mode);
  email_conn_mode = preferences.getInt(PrefKeys::EMAIL_CONN_MODE, email_conn_mode);
  telegram_conn_mode = preferences.getInt(PrefKeys::TG_CONN_MODE, telegram_conn_mode);
  sms_conn_mode = preferences.getInt(PrefKeys::SMS_CONN_MODE, sms_conn_mode);
  sms_enabled = preferences.getBool(PrefKeys::SMS_EN, sms_enabled);
  sms_phone_number = preferences.getString(PrefKeys::SMS_PHONE, sms_phone_number);

  Serial.println(F("[PREF] Loading BMP180 sensor configuration..."));
  Serial.flush();
  // Load BMP180 sensor configuration
  bmp180_enabled = preferences.getBool(PrefKeys::BMP180_EN, bmp180_enabled);
  bmp180_sda_pin = preferences.getInt(PrefKeys::BMP180_SDA, bmp180_sda_pin);
  bmp180_scl_pin = preferences.getInt(PrefKeys::BMP180_SCL, bmp180_scl_pin);
  include_bmp180_in_notifications = preferences.getBool(PrefKeys::BMP180_IN_NOTIF, include_bmp180_in_notifications);

  // Update input pin defaults based on board type before loading preferences
  // This ensures SIM7670G board uses safe pins that don't conflict with peripherals
  if (board_type == BOARD_SIM7670G) {
    // Safe pins for SIM7670G: 21, 38, 39, 40 (avoid modem/camera/SD/strapping pins)
    int safe_pins[MAX_INPUTS] = {21, 38, 39, 40};
    for (int i = 0; i < MAX_INPUTS; i++) {
      inputs[i].pin = safe_pins[i];
    }
    Serial.println(F("[PREF] Board is SIM7670G - using safe GPIO pins (21,38,39,40)"));
  } else {
    // Generic board can use standard pins
    int generic_pins[MAX_INPUTS] = {1, 2, 3, 47};
    for (int i = 0; i < MAX_INPUTS; i++) {
      inputs[i].pin = generic_pins[i];
    }
    Serial.println(F("[PREF] Board is Generic - using standard GPIO pins (1,2,3,47)"));
  }
  Serial.flush();

  Serial.println(F("[PREF] Loading input configurations..."));
  Serial.flush();
  // Load input configurations
  for (int i = 0; i < MAX_INPUTS; i++) {
    Serial.printf("[PREF] Loading input %d...\n", i);
    Serial.flush();
    String prefix = "in" + String(i) + "_";
    inputs[i].enabled = preferences.getBool((prefix + "en").c_str(), inputs[i].enabled);
    inputs[i].pin = preferences.getInt((prefix + "pin").c_str(), inputs[i].pin);
    inputs[i].momentary_mode = preferences.getBool((prefix + "mom").c_str(), inputs[i].momentary_mode);
    inputs[i].name = preferences.getString((prefix + "name").c_str(), inputs[i].name);
    inputs[i].message_on = preferences.getString((prefix + "on").c_str(), inputs[i].message_on);
    inputs[i].message_off = preferences.getString((prefix + "off").c_str(), inputs[i].message_off);
    // NEW: Load camera and GPS settings per input
    inputs[i].capture_photo = preferences.getBool((prefix + "cam").c_str(), inputs[i].capture_photo);
    inputs[i].include_gps = preferences.getBool((prefix + "gps").c_str(), inputs[i].include_gps);
  }

