cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  Serial.println(F("[PREF] Closing preferences..."));
  Serial.flush();
  preferences.end();
  Serial.println(F("[PREF] Preferences loaded successfully"));
  Serial.flush();
}

void savePreferences() {
  preferences.begin("notifier", false);

  preferences.putString(PrefKeys::WIFI_SSID, wifi_ssid);
  preferences.putString(PrefKeys::WIFI_PASS, wifi_password);
  preferences.putString(PrefKeys::WEB_USER, web_username);
  preferences.putString(PrefKeys::WEB_PASS, web_password);

  preferences.putString(PrefKeys::PB_TOKEN, pushbullet_token);
  preferences.putBool(PrefKeys::PB_ENABLED, pushbullet_enabled);

  preferences.putString(PrefKeys::SMTP_HOST, smtp_host);
  preferences.putInt(PrefKeys::SMTP_PORT, smtp_port);
  preferences.putString(PrefKeys::SMTP_EMAIL, smtp_email);
  preferences.putString(PrefKeys::SMTP_PASS, smtp_password);
  preferences.putString(PrefKeys::RCPT_EMAIL, recipient_email);
  preferences.putBool(PrefKeys::EMAIL_ENABLED, email_enabled);

  preferences.putString(PrefKeys::TG_TOKEN, telegram_token);
  preferences.putString(PrefKeys::TG_CHAT, telegram_chat_id);
  preferences.putBool(PrefKeys::TG_ENABLED, telegram_enabled);

  preferences.putString(PrefKeys::NOTIF_TITLE, notification_title);
  preferences.putLong(PrefKeys::GMT_OFFSET, gmt_offset);
  preferences.putInt(PrefKeys::DAY_OFFSET, daylight_offset);

  // NEW: Save board configuration
  preferences.putInt(PrefKeys::BOARD_TYPE, board_type);
  preferences.putBool(PrefKeys::CAMERA_EN, camera_enabled);
  preferences.putBool(PrefKeys::GPS_EN, gps_enabled);

  // NEW: v3.1 Save cellular configuration
  preferences.putBool(PrefKeys::CELL_EN, cellular_enabled);
  preferences.putString(PrefKeys::APN, apn);
  preferences.putInt(PrefKeys::PB_CONN_MODE, pushbullet_conn_mode);
  preferences.putInt(PrefKeys::EMAIL_CONN_MODE, email_conn_mode);
  preferences.putInt(PrefKeys::TG_CONN_MODE, telegram_conn_mode);
  preferences.putInt(PrefKeys::SMS_CONN_MODE, sms_conn_mode);
  preferences.putBool(PrefKeys::SMS_EN, sms_enabled);
  preferences.putString(PrefKeys::SMS_PHONE, sms_phone_number);

  // Save BMP180 sensor configuration
  preferences.putBool(PrefKeys::BMP180_EN, bmp180_enabled);
  preferences.putInt(PrefKeys::BMP180_SDA, bmp180_sda_pin);
  preferences.putInt(PrefKeys::BMP180_SCL, bmp180_scl_pin);
  preferences.putBool(PrefKeys::BMP180_IN_NOTIF, include_bmp180_in_notifications);

  // Save input configurations
  for (int i = 0; i < MAX_INPUTS; i++) {
    String prefix = "in" + String(i) + "_";
    preferences.putBool((prefix + "en").c_str(), inputs[i].enabled);
    preferences.putInt((prefix + "pin").c_str(), inputs[i].pin);
    preferences.putBool((prefix + "mom").c_str(), inputs[i].momentary_mode);
    preferences.putString((prefix + "name").c_str(), inputs[i].name);
    preferences.putString((prefix + "on").c_str(), inputs[i].message_on);
    preferences.putString((prefix + "off").c_str(), inputs[i].message_off);
    // NEW: Save camera and GPS settings per input
    preferences.putBool((prefix + "cam").c_str(), inputs[i].capture_photo);
    preferences.putBool((prefix + "gps").c_str(), inputs[i].include_gps);
  }

  preferences.end();
  Serial.println(F("Preferences saved"));
}

String htmlEncode(String str) {
  str.replace("&", "&amp;");
  str.replace("<", "&lt;");
  str.replace(">", "&gt;");
  str.replace("\"", "&quot;");
  str.replace("'", "&#39;");
  return str;
}

void setupWebServer() {
  server.on("/", []() {
    // No authentication required in AP mode
    if (!apMode && !server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleRoot();
  });

  server.on("/saveWiFi", HTTP_POST, []() {
    handleSaveWiFi();
  });

  server.on("/scanWiFi", []() {
    handleScanWiFi();
  });

  server.on("/save", HTTP_POST, []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleSave();
  });

  server.on("/status", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleStatus();
  });

  server.on("/restart", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleRestart();
  });

  server.on("/test/pushbullet", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleTestPushbullet();
  });

  server.on("/test/email", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleTestEmail();
  });

  server.on("/test/telegram", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleTestTelegram();
  });

  // NEW v3.0: Camera test endpoint
  server.on("/test/camera", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleTestCamera();
  });

  server.on("/test/input", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleTestInput();
  });

  server.on("/logs", []() {
    if (!apMode && !server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleLogs();
  });

  server.on("/resetWiFi", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleResetWiFi();
  });

  server.on("/api/config", []() {
    if (!apMode && !server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleGetConfig();
  });

  server.on("/gallery", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleGallery();
  });

  server.on("/api/photos", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handlePhotoList();
  });

