cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  server.on("/photo", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handlePhotoDownload();
  });

  server.on("/cellular", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleCellularDiagnostics();
  });

  server.on("/api/cellular", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleCellularAPI();
  });

  server.on("/cellular/refresh", []() {
    if (!server.authenticate(web_username.c_str(), web_password.c_str())) {
      return server.requestAuthentication();
    }
    handleCellularRefresh();
  });
}

void handleRoot() {
  // If in AP mode, show WiFi setup page
  if (apMode) {
    handleWiFiSetup();
    return;
  }

  String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'><title>ESP32-Notifier v");
  html += VERSION;
  html += F("</title><style>"
  ":root{--bg:#f0f0f0;--card:#fff;--text:#333;--text2:#555;--text3:#666;--border:#ddd;--section:#f9f9f9;--status:#e7f3fe;--status-border:#2196F3}"
  "body.dark{--bg:#1a1a1a;--card:#2d2d2d;--text:#e0e0e0;--text2:#b0b0b0;--text3:#909090;--border:#404040;--section:#252525;--status:#1e3a5f;--status-border:#4fc3f7}"
  "body{font-family:Arial;margin:20px;background:var(--bg);color:var(--text);transition:all 0.3s}"
  ".c{max-width:800px;margin:auto;background:var(--card);padding:20px;border-radius:8px;box-shadow:0 2px 10px rgba(0,0,0,0.1)}"
  "h1{color:var(--text);display:flex;justify-content:space-between;align-items:center}"
  ".theme-toggle{background:none;border:2px solid var(--border);padding:6px 12px;cursor:pointer;border-radius:4px;font-size:18px;transition:all 0.3s}"
  ".theme-toggle:hover{border-color:var(--text3);transform:scale(1.1)}"
  ".s{margin:15px 0;padding:12px;background:var(--section);border-radius:5px;border:1px solid var(--border)}.s h2{margin-top:0;color:var(--text2);font-size:16px}"
  "label{display:block;margin:8px 0 4px;font-weight:bold;color:var(--text3);font-size:14px}"
  "input,textarea,select{width:100%;padding:6px;box-sizing:border-box;border:1px solid var(--border);border-radius:4px;font-size:13px;background:var(--card);color:var(--text)}"
  "input[type=checkbox]{width:auto;margin-right:6px}textarea{min-height:50px;font-family:monospace}"
  "button{background:#4CAF50;color:#fff;padding:8px 16px;border:none;border-radius:4px;cursor:pointer;margin:4px 4px 4px 0;font-size:13px;transition:all 0.2s}"
  "button:hover{opacity:0.9;transform:translateY(-1px)}"
  ".b1{background:#008CBA}.b2{background:#f44336}.b3{background:#FF9800}.b4{background:#9C27B0}"
  ".st{padding:8px;background:var(--status);border-left:4px solid var(--status-border);margin:10px 0;font-size:13px;border-radius:4px}"
  ".inp{border:1px solid var(--border);padding:10px;margin:10px 0;background:var(--section);border-radius:4px}"
  ".badge{display:inline-block;padding:3px 8px;border-radius:12px;font-size:11px;font-weight:bold;margin-left:8px}"
  ".badge.success{background:#4CAF50;color:#fff}.badge.error{background:#f44336;color:#fff}.badge.warning{background:#FF9800;color:#fff}"
  "</style></head><body><div class='c'><h1><span>ESP32-Notifier v");
  html += VERSION;
  html += F("</span><button type='button' class='theme-toggle' onclick='toggleTheme()' title='Toggle Dark Mode'>🌓</button></h1>"
  "<div class='st' id='sb'><b>Status:</b> <span id='st'>Loading...</span></div>");

  html += F("<form method='POST' action='/save'>");

  // WiFi
  html += F("<div class='s'><h2>WiFi</h2><label>SSID:</label><input name='wifi_ssid' value='");
  html += htmlEncode(wifi_ssid);
  html += F("' required><label>Password:</label><input type='password' name='wifi_password' value='");
  html += htmlEncode(wifi_password);
  html += F("'><button type='button' class='b2' style='margin-top:10px' onclick=\"if(confirm('Reset WiFi credentials and restart in AP mode?'))location.href='/resetWiFi'\">Reset WiFi</button></div>");

  // Web Auth
  html += F("<div class='s'><h2>Web Authentication</h2><label>Username:</label><input name='web_user' value='");
  html += htmlEncode(web_username);
  html += F("'><label>Password:</label><input type='password' name='web_pass' value='");
  html += htmlEncode(web_password);
  html += F("'></div>");

  // NEW v3.0: Board Configuration
  html += F("<div class='s'><h2>Board Configuration</h2><label>Board Type:</label><select name='board_type'>");
  html += F("<option value='0'");
  if (board_type == BOARD_GENERIC) html += F(" selected");
  html += F(">Generic ESP32-S3</option>");
  html += F("<option value='1'");
  if (board_type == BOARD_SIM7670G) html += F(" selected");
  html += F(">ESP32-S3-SIM7670G-4G (Waveshare)</option>");
  html += F("<option value='2'");
  if (board_type == BOARD_FREENOVE_S3) html += F(" selected");
  html += F(">Freenove ESP32-S3 CAM</option></select>");

  // Camera and GPS options (only shown for SIM7670G board)
  html += F("<div style='margin-top:10px'><label><input type='checkbox' name='camera_en' value='1'");
  if (camera_enabled) html += F(" checked");
  html += F(">Enable Camera (OV2640)</label>");
  if (camera_enabled && camera_initialized) {
    html += F("<button type='button' class='b3' onclick='testService(\"camera\")'>Test Camera</button>");
  }
  html += F("<label><input type='checkbox' name='gps_en' value='1'");
  if (gps_enabled) html += F(" checked");
  html += F(">Enable GPS/GNSS</label>");

  // Status indicators
  if (board_type == BOARD_SIM7670G) {
    html += F("<p style='font-size:12px;margin-top:8px;color:#666'>");
    if (camera_initialized) html += F("📷 Camera: Ready<br>");
    if (sd_card_available) {
      #ifdef HAS_CAMERA_LIB
      uint64_t cardSize = SD_MMC.cardSize() / (1024 * 1024);
      html += F("💾 SD Card: ");
      html += String((uint32_t)cardSize);
      html += F(" MB<br>");
      #endif
    }
    #ifdef HAS_GPS_LIB
    if (gps_enabled && gps != nullptr) {
      html += F("🛰️ GPS: ");
      html += gps->satellites.isValid() ? "Fix (" + String(gps->satellites.value()) + " sats)" : "Searching";
    }
    #endif
    html += F("</p>");
  }
  html += F("</div></div>");

  // NEW v3.1: Cellular/4G Configuration
  if (board_type == BOARD_SIM7670G) {
    html += F("<div class='s'><h2>Cellular / 4G Configuration</h2>");
    html += F("<label><input type='checkbox' name='cell_en' value='1'");
    if (cellular_enabled) html += F(" checked");
    html += F(">Enable Cellular Modem</label>");
    html += F("<label>APN (Access Point Name):</label><input name='apn' value='");
    html += htmlEncode(apn);
    html += F("' placeholder='e.g., internet, wholesale, etc.'>");

    // Status indicators
    html += F("<p style='font-size:12px;margin-top:8px;color:#666'>");
    if (cellular_connected) {
      html += F("📶 Cellular: Connected to ");
      html += cellular_operator;
      html += F(" (Signal: ");
      html += String(cellular_signal_strength);
      html += F(")<br>");
    } else if (cellular_enabled) {
      html += F("📶 Cellular: Disconnected<br>");
    }
    html += F("</p>");
    html += F("</div>");
  }

  // BMP180 Sensor Configuration
  html += F("<div class='s'><h2>BMP180 Sensor (Temperature/Pressure)</h2>");
  html += F("<label><input type='checkbox' name='bmp180_en' value='1'");
  if (bmp180_enabled) html += F(" checked");
  html += F(">Enable BMP180 Sensor</label>");
  html += F("<label>SDA Pin (I2C Data):</label><input type='number' name='bmp180_sda' value='");
  html += String(bmp180_sda_pin);
  html += F("' min='0' max='48'>");
  html += F("<label>SCL Pin (I2C Clock):</label><input type='number' name='bmp180_scl' value='");
  html += String(bmp180_scl_pin);
  html += F("' min='0' max='48'>");
  html += F("<label><input type='checkbox' name='bmp180_notif' value='1'");
  if (include_bmp180_in_notifications) html += F(" checked");
  html += F(">Include sensor data in notifications</label>");

  // Status indicators
  html += F("<p style='font-size:12px;margin-top:8px;color:#666'>");
  if (bmp180_initialized) {
    html += F("✓ Sensor: Initialized<br>");
    html += F("🌡️ Temperature: ");
    html += String(last_temperature, 1);
    html += F("°C / ");
    html += String(last_temperature * 9.0 / 5.0 + 32.0, 1);
    html += F("°F<br>");
    html += F("🔽 Pressure: ");
    html += String(last_pressure, 1);
    html += F(" hPa / ");
    html += String(last_pressure * 0.02953, 2);
    html += F(" inHg<br>");
    html += F("⛰️ Altitude: ");
    html += String(last_altitude, 1);
    html += F(" m / ");
    html += String(last_altitude * 3.28084, 1);
    html += F(" ft");
  } else if (bmp180_enabled) {
    html += F("⚠️ Sensor not detected - check wiring");
  } else {
    html += F("Sensor disabled");
  }
  html += F("</p>");
  html += F("<p style='font-size:11px;color:#999;margin-top:5px'>");
  html += F("Default pins: SDA=21, SCL=22. Connect VCC to 3.3V and GND to GND.");
  html += F("</p>");
  html += F("</div>");

  // Pushbullet
  html += F("<div class='s'><h2>Pushbullet</h2><label><input type='checkbox' name='pb_enabled' value='1'");
  if (pushbullet_enabled) html += F(" checked");
  html += F(">Enable</label><label>Token:</label><input name='pb_token' value='");
  html += htmlEncode(pushbullet_token);
  html += F("'>");

