cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  // NEW v3.1: Connection mode selector
  if (board_type == BOARD_SIM7670G && cellular_enabled) {
    html += F("<label>Connection Mode:</label><select name='pb_conn_mode'>");
    html += F("<option value='0'");
    if (pushbullet_conn_mode == CONN_WIFI_ONLY) html += F(" selected");
    html += F(">WiFi Only</option>");
    html += F("<option value='1'");
    if (pushbullet_conn_mode == CONN_CELL_ONLY) html += F(" selected");
    html += F(">Cellular Only</option>");
    html += F("<option value='2'");
    if (pushbullet_conn_mode == CONN_WIFI_CELL_BACKUP) html += F(" selected");
    html += F(">WiFi with Cellular Backup</option></select>");
  }

  html += F("<button type='button' class='b3' onclick='testService(\"pushbullet\")'>Test</button></div>");

  // Email
  html += F("<div class='s'><h2>Email</h2><label><input type='checkbox' name='email_enabled' value='1'");
  if (email_enabled) html += F(" checked");
  html += F(">Enable</label><label>Server:</label><input name='smtp_host' value='");
  html += htmlEncode(smtp_host);
  html += F("'><label>Port:</label><input type='number' name='smtp_port' value='");
  html += String(smtp_port);
  html += F("'><label>Email:</label><input name='smtp_email' value='");
  html += htmlEncode(smtp_email);
  html += F("'><label>Password:</label><input type='password' name='smtp_password' value='");
  html += htmlEncode(smtp_password);
  html += F("'><label>Recipient:</label><input name='recipient_email' value='");
  html += htmlEncode(recipient_email);
  html += F("'>");

  // NEW v3.1: Connection mode selector
  if (board_type == BOARD_SIM7670G && cellular_enabled) {
    html += F("<label>Connection Mode:</label><select name='email_conn_mode'>");
    html += F("<option value='0'");
    if (email_conn_mode == CONN_WIFI_ONLY) html += F(" selected");
    html += F(">WiFi Only</option>");
    html += F("<option value='1'");
    if (email_conn_mode == CONN_CELL_ONLY) html += F(" selected");
    html += F(">Cellular Only</option>");
    html += F("<option value='2'");
    if (email_conn_mode == CONN_WIFI_CELL_BACKUP) html += F(" selected");
    html += F(">WiFi with Cellular Backup</option></select>");
  }

  html += F("<button type='button' class='b3' onclick='testService(\"email\")'>Test</button></div>");

  // Telegram
  html += F("<div class='s'><h2>Telegram</h2><label><input type='checkbox' name='tg_enabled' value='1'");
  if (telegram_enabled) html += F(" checked");
  html += F(">Enable</label><label>Bot Token:</label><input name='tg_token' value='");
  html += htmlEncode(telegram_token);
  html += F("'><label>Chat ID:</label><input name='tg_chat' value='");
  html += htmlEncode(telegram_chat_id);
  html += F("'>");

  // NEW v3.1: Connection mode selector
  if (board_type == BOARD_SIM7670G && cellular_enabled) {
    html += F("<label>Connection Mode:</label><select name='tg_conn_mode'>");
    html += F("<option value='0'");
    if (telegram_conn_mode == CONN_WIFI_ONLY) html += F(" selected");
    html += F(">WiFi Only</option>");
    html += F("<option value='1'");
    if (telegram_conn_mode == CONN_CELL_ONLY) html += F(" selected");
    html += F(">Cellular Only</option>");
    html += F("<option value='2'");
    if (telegram_conn_mode == CONN_WIFI_CELL_BACKUP) html += F(" selected");
    html += F(">WiFi with Cellular Backup</option></select>");
  }

  html += F("<button type='button' class='b3' onclick='testService(\"telegram\")'>Test</button></div>");

  // NEW v3.1: SMS Configuration
  if (board_type == BOARD_SIM7670G && cellular_enabled) {
    html += F("<div class='s'><h2>SMS Notifications</h2>");
    html += F("<label><input type='checkbox' name='sms_en' value='1'");
    if (sms_enabled) html += F(" checked");
    html += F(">Enable SMS</label>");
    html += F("<label>Phone Number:</label><input name='sms_phone' value='");
    html += htmlEncode(sms_phone_number);
    html += F("' placeholder='e.g., +15551234567'>");
    html += F("<label>Connection Mode:</label><select name='sms_conn_mode'>");
    html += F("<option value='0'");
    if (sms_conn_mode == CONN_WIFI_ONLY) html += F(" selected");
    html += F(">WiFi Only</option>");
    html += F("<option value='1'");
    if (sms_conn_mode == CONN_CELL_ONLY) html += F(" selected");
    html += F(">Cellular Only</option>");
    html += F("<option value='2'");
    if (sms_conn_mode == CONN_WIFI_CELL_BACKUP) html += F(" selected");
    html += F(">WiFi with Cellular Backup</option></select>");
    html += F("<p style='font-size:12px;margin-top:8px;color:#666'>Note: SMS is sent via cellular modem. Messages are limited to 160 characters.</p>");
    html += F("</div>");
  }

  // Inputs
  html += F("<div class='s'><h2>Inputs Configuration</h2>");
  for (int i = 0; i < MAX_INPUTS; i++) {
    html += F("<div class='inp'><h3>Input ");
    html += String(i + 1);
    html += F("</h3><label><input type='checkbox' name='in");
    html += String(i);
    html += F("_en' value='1'");
    if (inputs[i].enabled) html += F(" checked");
    html += F(">Enabled</label><label>Name:</label><input name='in");
    html += String(i);
    html += F("_name' value='");
    html += htmlEncode(inputs[i].name);
    html += F("'><label>GPIO Pin:</label><input type='number' name='in");
    html += String(i);
    html += F("_pin' value='");
    html += String(inputs[i].pin);
    html += F("' min='0' max='48'><label>Mode:</label><select name='in");
    html += String(i);
    html += F("_mode'><option value='toggle'");
    if (!inputs[i].momentary_mode) html += F(" selected");
    html += F(">Toggle</option><option value='momentary'");
    if (inputs[i].momentary_mode) html += F(" selected");
    html += F(">Momentary</option></select><label>ON Message:</label><textarea name='in");
    html += String(i);
    html += F("_on'>");
    html += htmlEncode(inputs[i].message_on);
    html += F("</textarea><label>OFF Message:</label><textarea name='in");
    html += String(i);
    html += F("_off'>");
    html += htmlEncode(inputs[i].message_off);
    html += F("</textarea>");

    // NEW v3.0: Camera and GPS options per input
    if (board_type == BOARD_SIM7670G) {
      html += F("<div style='margin-top:10px;padding-top:10px;border-top:1px solid #ddd'>");
      html += F("<label><input type='checkbox' name='in");
      html += String(i);
      html += F("_cam' value='1'");
      if (inputs[i].capture_photo) html += F(" checked");
      html += F(">📷 Capture Photo on Trigger</label>");
      html += F("<label><input type='checkbox' name='in");
      html += String(i);
      html += F("_gps' value='1'");
      if (inputs[i].include_gps) html += F(" checked");
      html += F(">🛰️ Include GPS Location</label>");
      html += F("</div>");
    }

