cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
    // Manual testing section
    if (inputs[i].enabled) {
      html += F("<div style='margin-top:10px;padding-top:10px;border-top:1px solid #ddd'>");
      html += F("<label>Current State: <span id='inp");
      html += String(i);
      html += F("_state' class='badge'>...</span></label>");
      html += F("<button type='button' class='b3' onclick='testInput(");
      html += String(i);
      html += F(")'>🧪 Test Trigger</button>");
      html += F("</div>");
    }

    html += F("</div>");
  }
  html += F("</div>");

  // General settings
  html += F("<div class='s'><h2>General</h2><label>Title:</label><input name='notif_title' value='");
  html += htmlEncode(notification_title);
  html += F("'><label>Timezone:</label><select name='gmt_offset'>"
  "<option value='-43200'>UTC-12 (Baker Island)</option>"
  "<option value='-39600'>UTC-11 (Samoa)</option>"
  "<option value='-36000'>UTC-10 (Hawaii)</option>"
  "<option value='-32400'>UTC-9 (Alaska)</option>"
  "<option value='-28800'>UTC-8 (Pacific Time)</option>"
  "<option value='-25200'>UTC-7 (Mountain Time)</option>"
  "<option value='-21600'>UTC-6 (Central Time)</option>"
  "<option value='-18000'>UTC-5 (Eastern Time)</option>"
  "<option value='-14400'>UTC-4 (Atlantic Time)</option>"
  "<option value='-12600'>UTC-3.5 (Newfoundland)</option>"
  "<option value='-10800'>UTC-3 (Brazil, Argentina)</option>"
  "<option value='-7200'>UTC-2 (Mid-Atlantic)</option>"
  "<option value='-3600'>UTC-1 (Azores)</option>"
  "<option value='0'>UTC+0 (London, Lisbon)</option>"
  "<option value='3600'>UTC+1 (Paris, Berlin)</option>"
  "<option value='7200'>UTC+2 (Athens, Cairo)</option>"
  "<option value='10800'>UTC+3 (Moscow, Istanbul)</option>"
  "<option value='12600'>UTC+3.5 (Tehran)</option>"
  "<option value='14400'>UTC+4 (Dubai, Baku)</option>"
  "<option value='16200'>UTC+4.5 (Kabul)</option>"
  "<option value='18000'>UTC+5 (Pakistan, Maldives)</option>"
  "<option value='19800'>UTC+5.5 (India, Sri Lanka)</option>"
  "<option value='20700'>UTC+5.75 (Nepal)</option>"
  "<option value='21600'>UTC+6 (Bangladesh, Bhutan)</option>"
  "<option value='23400'>UTC+6.5 (Myanmar)</option>"
  "<option value='25200'>UTC+7 (Bangkok, Jakarta)</option>"
  "<option value='28800'>UTC+8 (China, Singapore)</option>"
  "<option value='31500'>UTC+8.75 (Eucla, Australia)</option>"
  "<option value='32400'>UTC+9 (Tokyo, Seoul)</option>"
  "<option value='34200'>UTC+9.5 (Adelaide)</option>"
  "<option value='36000'>UTC+10 (Sydney, Melbourne)</option>"
  "<option value='37800'>UTC+10.5 (Lord Howe Island)</option>"
  "<option value='39600'>UTC+11 (Solomon Islands)</option>"
  "<option value='43200'>UTC+12 (New Zealand, Fiji)</option>"
  "<option value='45900'>UTC+12.75 (Chatham Islands)</option>"
  "<option value='46800'>UTC+13 (Tonga)</option>"
  "<option value='50400'>UTC+14 (Line Islands)</option>"
  "</select><label>DST Offset (sec):</label><input type='number' name='day_offset' value='");
  html += String(daylight_offset);
  html += F("'></div>");

  html += F("<button type='submit'>Save Configuration</button><button type='button' class='b1' onclick='location.reload()'>Refresh</button>");
  html += F("<button type='button' class='b3' onclick=\"location.href='/logs'\">View Logs</button>");

  // Add photo gallery button if camera and SD card are available
  if (camera_enabled && camera_initialized && sd_card_available) {
    html += F("<button type='button' class='b4' onclick=\"location.href='/gallery'\">📷 Photo Gallery</button>");
  }

  html += F("<button type='button' class='b3' onclick='downloadConfig()'>💾 Backup Config</button>");

  // Add cellular diagnostics button if board supports it
  if (board_type == BOARD_SIM7670G) {
    html += F("<button type='button' class='b4' onclick=\"location.href='/cellular'\">📶 Cellular Diagnostics</button>");
  }

  html += F("<button type='button' class='b2' onclick=\"if(confirm('Restart?'))location.href='/restart'\">Restart</button></form></div>");

  html += F("<script>"
  "function toggleTheme(){document.body.classList.toggle('dark');localStorage.setItem('theme',document.body.classList.contains('dark')?'dark':'light')}"
  "if(localStorage.getItem('theme')==='dark')document.body.classList.add('dark');"
  "function testService(s){fetch('/test/'+s).then(r=>r.text()).then(d=>alert(s+': '+d)).catch(e=>alert('Error: '+e))}"
  "function testInput(i){if(confirm('Trigger Input '+(i+1)+'?')){fetch('/test/input?id='+i).then(r=>r.text()).then(d=>alert(d)).catch(e=>alert('Error: '+e))}}"
  "function downloadConfig(){fetch('/api/config').then(r=>r.json()).then(d=>{"
  "const blob=new Blob([JSON.stringify(d,null,2)],{type:'application/json'});"
  "const url=URL.createObjectURL(blob);const a=document.createElement('a');a.href=url;"
  "a.download='esp32-notifier-config.json';a.click();URL.revokeObjectURL(url);"
  "}).catch(e=>alert('Error downloading config: '+e))}"
  "function updateStatus(){fetch('/status').then(r=>r.json()).then(d=>{"
  "let s='WiFi:'+(d.wifi?'✓':'✗')+' |IP:'+d.ip+' |Up:'+Math.floor(d.uptime/1000)+'s';"
  "if(d.heap)s+=' |Heap:'+Math.round(d.heap/1024)+'KB';"
  "d.inputs.forEach((inp,i)=>{"
  "s+=' |In'+(i+1)+':'+(inp?'H':'L');"
  "const el=document.getElementById('inp'+i+'_state');"
  "if(el){el.textContent=inp?'HIGH':'LOW';el.className='badge '+(inp?'warning':'success')}"
  "});"
  "document.getElementById('st').innerHTML=s}).catch(e=>console.error('Status update failed:',e))}"
  "updateStatus();setInterval(updateStatus,5000);"
  "document.querySelector('[name=gmt_offset]').value='");
  html += String(gmt_offset);
  html += F("';</script></body></html>");

  server.send(200, "text/html", html);
}

void handleWiFiSetup() {
  String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'>"
  "<title>ESP32-Notifier Setup</title><style>"
  "body{font-family:Arial;margin:20px;background:#f0f0f0}.c{max-width:600px;margin:auto;background:#fff;padding:20px;border-radius:8px}"
  "h1{color:#333;text-align:center}.s{margin:15px 0;padding:12px;background:#f9f9f9;border-radius:5px}"
  "label{display:block;margin:8px 0 4px;font-weight:bold;color:#666}input,select{width:100%;padding:8px;box-sizing:border-box;border:1px solid #ddd;border-radius:4px}"
  "button{background:#4CAF50;color:#fff;padding:10px 20px;border:none;border-radius:4px;cursor:pointer;width:100%;font-size:16px;margin-top:10px}"
  "button:hover{background:#45a049}.info{background:#e7f3fe;border-left:4px solid #2196F3;padding:10px;margin:15px 0}"
  ".net{padding:10px;margin:5px 0;background:#fff;border:1px solid #ddd;border-radius:4px;cursor:pointer;display:flex;justify-content:space-between;align-items:center}"
  ".net:hover{background:#f0f0f0}.scan-btn{background:#2196F3;margin-bottom:10px}.scan-btn:hover{background:#0b7dda}"
  ".signal{font-size:12px;color:#666}#networks{max-height:300px;overflow-y:auto}"
  "</style></head><body><div class='c'><h1>ESP32-Notifier Setup</h1>"
  "<div class='info'>Welcome! Connect to your WiFi network to get started.</div>"
  "<div class='s'><h2>Available Networks</h2>"
  "<button type='button' class='scan-btn' onclick='scanNetworks()'>Scan for Networks</button>"
  "<div id='networks'><p style='color:#666;text-align:center'>Click 'Scan for Networks' to see available WiFi networks</p></div></div>"
  "<form method='POST' action='/saveWiFi'><div class='s'><h2>WiFi Configuration</h2>"
  "<label>Network Name (SSID):</label><input id='ssid' name='ssid' required placeholder='Your WiFi Network'>"
  "<label>Password:</label><input type='password' name='password' required placeholder='WiFi Password'>"
  "</div><button type='submit'>Connect to WiFi</button></form>"
  "<div class='s' style='margin-top:20px'><small>After connecting, the device will restart and join your WiFi network. "
  "You can then access the full configuration page using the IP address shown in the Serial Monitor.</small></div>"
  "</div><script>"
  "function scanNetworks(){"
  "document.getElementById('networks').innerHTML='<p style=\"text-align:center\">Scanning...</p>';"
  "fetch('/scanWiFi').then(r=>r.json()).then(d=>{"
  "let h='';if(d.networks.length==0)h='<p style=\"color:#666;text-align:center\">No networks found</p>';else{"
  "d.networks.forEach(n=>{"
  "let bars='';for(let i=0;i<4;i++)bars+=(n.rssi>(-90+i*10)?'▂':' ');"
  "h+='<div class=\"net\" onclick=\"selectNetwork(\\''+n.ssid+'\\')\">';"
  "h+='<span>'+n.ssid+(n.enc?' 🔒':'')+'</span>';"
  "h+='<span class=\"signal\">'+bars+'</span></div>';})}"
  "document.getElementById('networks').innerHTML=h;"
  "}).catch(e=>{document.getElementById('networks').innerHTML='<p style=\"color:red\">Scan failed</p>';});}"
  "function selectNetwork(ssid){document.getElementById('ssid').value=ssid;document.getElementById('ssid').focus();}"
  "</script></body></html>");

  server.send(200, "text/html", html);
}

void handleSaveWiFi() {
  if (server.hasArg("ssid") && server.hasArg("password")) {
    wifi_ssid = server.arg("ssid");
    wifi_password = server.arg("password");

    savePreferences();

    String html = F("<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>"
    "<title>Connecting...</title><style>"
    "body{font-family:Arial;margin:20px;background:#f0f0f0;text-align:center}.c{max-width:600px;margin:auto;background:#fff;padding:40px;border-radius:8px}"
    "h1{color:#4CAF50}</style></head><body><div class='c'><h1>Connecting to WiFi...</h1>"
    "<p>Device is restarting and connecting to your network.</p>"
    "<p>Please check your Serial Monitor for the new IP address.</p>"
    "<p>This window will close automatically.</p></div>"
    "<script>setTimeout(function(){window.close()},5000);</script></body></html>");

    server.send(200, "text/html", html);

    delay(1000);
    ESP.restart();
  } else {
    server.send(400, "text/plain", "Missing WiFi credentials");
  }
}

void handleScanWiFi() {
  Serial.println(F("Scanning WiFi networks..."));
  int n = WiFi.scanNetworks();

  String json = "{\"networks\":[";

  if (n > 0) {
    for (int i = 0; i < n; i++) {
      if (i > 0) json += ",";
      json += "{";
      json += "\"ssid\":\"";

