cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
      // Properly escape SSID for JSON
      String ssid = WiFi.SSID(i);
      for (unsigned int j = 0; j < ssid.length(); j++) {
        char c = ssid.charAt(j);
        if (c == '"' || c == '\\') {
          json += '\\';
        }
        if (c >= 32 && c <= 126) {  // Printable ASCII only
          json += c;
        }
      }

      json += "\",";
      json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
      json += "\"enc\":" + String(WiFi.encryptionType(i) != WIFI_AUTH_OPEN ? "true" : "false");
      json += "}";
    }
  }

  json += "]}";

  WiFi.scanDelete();
  Serial.println(F("WiFi scan complete"));

  server.send(200, "application/json", json);
}

void handleSave() {
  if (server.hasArg("wifi_ssid")) wifi_ssid = server.arg("wifi_ssid");
  if (server.hasArg("wifi_password")) wifi_password = server.arg("wifi_password");
  if (server.hasArg("web_user")) web_username = server.arg("web_user");
  if (server.hasArg("web_pass")) web_password = server.arg("web_pass");

  if (server.hasArg("pb_token")) pushbullet_token = server.arg("pb_token");
  pushbullet_enabled = server.hasArg("pb_enabled");

  if (server.hasArg("smtp_host")) smtp_host = server.arg("smtp_host");
  if (server.hasArg("smtp_port")) smtp_port = server.arg("smtp_port").toInt();
  if (server.hasArg("smtp_email")) smtp_email = server.arg("smtp_email");
  if (server.hasArg("smtp_password")) smtp_password = server.arg("smtp_password");
  if (server.hasArg("recipient_email")) recipient_email = server.arg("recipient_email");
  email_enabled = server.hasArg("email_enabled");

  if (server.hasArg("tg_token")) telegram_token = server.arg("tg_token");
  if (server.hasArg("tg_chat")) telegram_chat_id = server.arg("tg_chat");
  telegram_enabled = server.hasArg("tg_enabled");

  if (server.hasArg("notif_title")) notification_title = server.arg("notif_title");

  // NEW v3.0: Board configuration
  if (server.hasArg("board_type")) {
    int newBoardType = server.arg("board_type").toInt();
    if (newBoardType != board_type) {
      board_type = newBoardType;
      // Board type changed - may need restart to re-initialize hardware
      addLog("INFO", "Board type changed - restart recommended");
    }
  }
  camera_enabled = server.hasArg("camera_en");
  gps_enabled = server.hasArg("gps_en");

  // NEW v3.1: Cellular configuration
  cellular_enabled = server.hasArg("cell_en");
  if (server.hasArg("apn")) apn = server.arg("apn");

  // Connection modes per service
  if (server.hasArg("pb_conn_mode")) pushbullet_conn_mode = server.arg("pb_conn_mode").toInt();
  if (server.hasArg("email_conn_mode")) email_conn_mode = server.arg("email_conn_mode").toInt();
  if (server.hasArg("tg_conn_mode")) telegram_conn_mode = server.arg("tg_conn_mode").toInt();
  if (server.hasArg("sms_conn_mode")) sms_conn_mode = server.arg("sms_conn_mode").toInt();

  // SMS configuration
  sms_enabled = server.hasArg("sms_en");
  if (server.hasArg("sms_phone")) sms_phone_number = server.arg("sms_phone");

  // BMP180 sensor configuration
  bool bmp180_was_enabled = bmp180_enabled;
  int old_sda = bmp180_sda_pin;
  int old_scl = bmp180_scl_pin;

  bmp180_enabled = server.hasArg("bmp180_en");
  if (server.hasArg("bmp180_sda")) bmp180_sda_pin = server.arg("bmp180_sda").toInt();
  if (server.hasArg("bmp180_scl")) bmp180_scl_pin = server.arg("bmp180_scl").toInt();
  include_bmp180_in_notifications = server.hasArg("bmp180_notif");

  // Re-initialize sensor if settings changed
  if (bmp180_enabled && (!bmp180_was_enabled || old_sda != bmp180_sda_pin || old_scl != bmp180_scl_pin)) {
    addLog("INFO", "BMP180 settings changed - reinitializing sensor");
    bmp180_initialized = false;
    initBMP180();
  } else if (!bmp180_enabled && bmp180_was_enabled) {
    addLog("INFO", "BMP180 sensor disabled");
    bmp180_initialized = false;
  }

  bool timeChanged = false;
  if (server.hasArg("gmt_offset")) {
    long newOffset = server.arg("gmt_offset").toInt();
    if (newOffset != gmt_offset) {
      gmt_offset = newOffset;
      timeChanged = true;
    }
  }
  if (server.hasArg("day_offset")) {
    int newOffset = server.arg("day_offset").toInt();
    if (newOffset != daylight_offset) {
      daylight_offset = newOffset;
      timeChanged = true;
    }
  }

  if (timeChanged) {
    configTime(gmt_offset, daylight_offset, ntpServer);
  }

  // Save input configurations
  for (int i = 0; i < MAX_INPUTS; i++) {
    String prefix = "in" + String(i) + "_";

    bool wasEnabled = inputs[i].enabled;
    int oldPin = inputs[i].pin;

    inputs[i].enabled = server.hasArg((prefix + "en").c_str());

    if (server.hasArg((prefix + "name").c_str())) {
      inputs[i].name = server.arg((prefix + "name").c_str());
    }

    if (server.hasArg((prefix + "pin").c_str())) {
      int newPin = server.arg((prefix + "pin").c_str()).toInt();
      if (newPin >= 0 && newPin <= 48) {
        if (newPin != oldPin) {
          pinMode(oldPin, INPUT);
          inputs[i].pin = newPin;
          if (inputs[i].enabled) {
            pinMode(newPin, INPUT_PULLDOWN);
            inputs[i].lastState = digitalRead(newPin);
          }
        }
      }
    }

    if (server.hasArg((prefix + "mode").c_str())) {
      inputs[i].momentary_mode = (server.arg((prefix + "mode").c_str()) == "momentary");
    }

    if (server.hasArg((prefix + "on").c_str())) {
      inputs[i].message_on = server.arg((prefix + "on").c_str());
    }

    if (server.hasArg((prefix + "off").c_str())) {
      inputs[i].message_off = server.arg((prefix + "off").c_str());
    }

    // NEW v3.0: Handle camera and GPS per input
    inputs[i].capture_photo = server.hasArg((prefix + "cam").c_str());
    inputs[i].include_gps = server.hasArg((prefix + "gps").c_str());

    // Handle enable/disable state changes
    if (!wasEnabled && inputs[i].enabled) {
      pinMode(inputs[i].pin, INPUT_PULLDOWN);
      inputs[i].lastState = digitalRead(inputs[i].pin);
    } else if (wasEnabled && !inputs[i].enabled) {
      pinMode(inputs[i].pin, INPUT);
    }
  }

  savePreferences();
  server.send(200, "text/html", F("<html><head><meta http-equiv='refresh' content='2;url=/'></head><body style='text-align:center;padding:50px'><h1>Saved!</h1></body></html>"));
}

void handleStatus() {
  StaticJsonDocument<768> doc;
  doc["wifi"] = WiFi.status() == WL_CONNECTED;
  doc["ip"] = WiFi.localIP().toString();
  doc["uptime"] = millis();
  doc["heap"] = ESP.getFreeHeap();
  doc["psram"] = ESP.getFreePsram();

  // Cellular status
  if (board_type == BOARD_SIM7670G) {
    JsonObject cellular = doc.createNestedObject("cellular");
    cellular["enabled"] = cellular_enabled;
    cellular["connected"] = cellular_connected;
    cellular["operator"] = cellular_operator;
    cellular["signal"] = cellular_signal_strength;
  }

  JsonArray inputsArray = doc.createNestedArray("inputs");
  for (int i = 0; i < MAX_INPUTS; i++) {
    if (inputs[i].enabled) {
      inputsArray.add(digitalRead(inputs[i].pin) == HIGH);
    } else {
      inputsArray.add(false);
    }
  }

  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void handleRestart() {
  server.send(200, "text/html", F("<html><body><h2>Restarting...</h2></body></html>"));
  delay(1000);
  ESP.restart();
}

void handleTestPushbullet() {
  if (pushbullet_token.length() > 0) {
    bool success = sendPushbulletNotification("Test", "Pushbullet test notification from Notifier v" VERSION);
    server.send(200, "text/plain", success ? "SUCCESS" : "FAILED");
  } else {
    server.send(400, "text/plain", "No token configured");
  }
}

void handleTestEmail() {
  if (smtp_email.length() > 0 && recipient_email.length() > 0) {
    bool success = sendEmailNotification("Test", "Email test notification from Notifier v" VERSION);
    server.send(200, "text/plain", success ? "SUCCESS" : "FAILED");
  } else {
    server.send(400, "text/plain", "Email not configured");
  }
}

void handleTestTelegram() {
  if (telegram_token.length() > 0 && telegram_chat_id.length() > 0) {
    bool success = sendTelegramNotification("Telegram test notification from Notifier v" VERSION);
    server.send(200, "text/plain", success ? "SUCCESS" : "FAILED");
  } else {
    server.send(400, "text/plain", "Telegram not configured");
  }
}

void handleTestCamera() {
  if (!camera_enabled || !camera_initialized) {
    server.send(400, "text/plain", "Camera not enabled or initialized");
    return;
  }

  String filename = capturePhoto();
  if (filename.length() > 0) {
    server.send(200, "text/plain", "SUCCESS - Photo saved: " + filename);
  } else {
    server.send(500, "text/plain", "FAILED - Could not capture photo");
  }
}

