cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
void handleTestInput() {
  if (!server.hasArg("id")) {
    server.send(400, "text/plain", "Missing input ID parameter");
    return;
  }

  int inputId = server.arg("id").toInt();
  if (inputId < 0 || inputId >= MAX_INPUTS) {
    server.send(400, "text/plain", "Invalid input ID");
    return;
  }

  if (!inputs[inputId].enabled) {
    server.send(400, "text/plain", "Input " + String(inputId + 1) + " is not enabled");
    return;
  }

  // Simulate input trigger
  Serial.printf("Manual test triggered for Input %d (%s)\n", inputId + 1, inputs[inputId].name.c_str());
  addLog("INFO", "Manual trigger test: Input " + String(inputId + 1));

  // Get current timestamp
  struct tm timeinfo;
  String timestamp = "Unknown time";
  if (getLocalTime(&timeinfo)) {
    char buffer[32];
    strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S", &timeinfo);
    timestamp = String(buffer);
  }

  // Use ON message for manual test
  String message = inputs[inputId].message_on;
  message.replace("{name}", inputs[inputId].name);
  message.replace("{timestamp}", timestamp);

  // Capture photo if enabled for this input
  String photoFilename = "";
  if (inputs[inputId].capture_photo && camera_enabled && camera_initialized) {
    photoFilename = capturePhoto();
  }

  // Send notifications
  bool anySuccess = false;
  if (pushbullet_enabled && pushbullet_token.length() > 0) {
    anySuccess |= sendPushbulletNotification(notification_title, message);
  }
  if (email_enabled && recipient_email.length() > 0) {
    anySuccess |= sendEmailNotification(notification_title, message);
  }
  if (telegram_enabled && telegram_token.length() > 0) {
    anySuccess |= sendTelegramNotification(message);
  }

  String response = "Test notification sent for Input " + String(inputId + 1) + " (" + inputs[inputId].name + ")";
  if (photoFilename.length() > 0) {
    response += "\nPhoto captured: " + photoFilename;
  }
  if (anySuccess) {
    response += "\nNotifications: SUCCESS";
  } else {
    response += "\nNotifications: No services enabled or configured";
  }

  server.send(200, "text/plain", response);
}

void handleResetWiFi() {
  String html = F("<!DOCTYPE html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>"
  "<title>Resetting WiFi...</title><style>"
  "body{font-family:Arial;margin:20px;background:#f0f0f0;text-align:center}"
  ".container{max-width:600px;margin:auto;background:#fff;padding:40px;border-radius:8px;box-shadow:0 2px 10px rgba(0,0,0,0.1)}"
  "h1{color:#f44336}p{color:#666;line-height:1.6}"
  "</style></head><body><div class='container'>"
  "<h1>WiFi Settings Reset</h1>"
  "<p>WiFi credentials have been cleared.</p>"
  "<p>The device will restart in Access Point mode.</p>"
  "<p><strong>Connect to:</strong> ESP32-Notifier-Setup</p>"
  "<p><strong>Password:</strong> setup123</p>"
  "<p><strong>Setup URL:</strong> http://192.168.4.1</p>"
  "<p>This window will close automatically...</p>"
  "</div><script>setTimeout(function(){window.close()},3000);</script></body></html>");

  // Clear WiFi credentials
  wifi_ssid = "";
  wifi_password = "";

  // Save empty credentials
  savePreferences();

  addLog("INFO", "WiFi credentials reset - restarting in AP mode");

  server.send(200, "text/html", html);

  delay(2000);
  ESP.restart();
}

void handleGetConfig() {
  StaticJsonDocument<2048> doc;

  doc["version"] = VERSION;
  doc["wifi_ssid"] = wifi_ssid;
  doc["web_username"] = web_username;
  doc["board_type"] = board_type;
  doc["camera_enabled"] = camera_enabled;
  doc["gps_enabled"] = gps_enabled;
  doc["cellular_enabled"] = cellular_enabled;
  doc["apn"] = apn;

  doc["pushbullet_enabled"] = pushbullet_enabled;
  doc["pushbullet_token"] = pushbullet_token;
  doc["pushbullet_conn_mode"] = pushbullet_conn_mode;

  doc["email_enabled"] = email_enabled;
  doc["smtp_host"] = smtp_host;
  doc["smtp_port"] = smtp_port;
  doc["smtp_email"] = smtp_email;
  doc["recipient_email"] = recipient_email;
  doc["email_conn_mode"] = email_conn_mode;

  doc["telegram_enabled"] = telegram_enabled;
  doc["telegram_token"] = telegram_token;
  doc["telegram_chat_id"] = telegram_chat_id;
  doc["telegram_conn_mode"] = telegram_conn_mode;

  doc["sms_enabled"] = sms_enabled;
  doc["sms_phone_number"] = sms_phone_number;
  doc["sms_conn_mode"] = sms_conn_mode;

  doc["notification_title"] = notification_title;
  doc["gmt_offset"] = gmt_offset;
  doc["daylight_offset"] = daylight_offset;

  JsonArray inputsArray = doc.createNestedArray("inputs");
  for (int i = 0; i < MAX_INPUTS; i++) {
    JsonObject input = inputsArray.createNestedObject();
    input["enabled"] = inputs[i].enabled;
    input["name"] = inputs[i].name;
    input["pin"] = inputs[i].pin;
    input["momentary_mode"] = inputs[i].momentary_mode;
    input["capture_photo"] = inputs[i].capture_photo;
    input["include_gps"] = inputs[i].include_gps;
    input["message_on"] = inputs[i].message_on;
    input["message_off"] = inputs[i].message_off;
  }

  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void handleGallery() {
  #ifdef HAS_CAMERA_LIB
  if (!camera_enabled || !sd_card_available) {
    server.send(400, "text/plain", "Camera or SD card not available");
    return;
  }

  String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'>"
  "<title>Photo Gallery - ESP32-Notifier</title><style>"
  ":root{--bg:#f0f0f0;--card:#fff;--text:#333;--border:#ddd}"
  "body.dark{--bg:#1a1a1a;--card:#2d2d2d;--text:#e0e0e0;--border:#404040}"
  "body{font-family:Arial;margin:20px;background:var(--bg);color:var(--text);transition:all 0.3s}"
  ".c{max-width:1200px;margin:auto;background:var(--card);padding:20px;border-radius:8px;box-shadow:0 2px 10px rgba(0,0,0,0.1)}"
  "h1{display:flex;justify-content:space-between;align-items:center}"
  ".theme-toggle{background:none;border:2px solid var(--border);padding:6px 12px;cursor:pointer;border-radius:4px;font-size:18px}"
  ".back{display:inline-block;background:#4CAF50;color:#fff;padding:8px 16px;text-decoration:none;border-radius:4px;margin-bottom:10px}"
  ".gallery{display:grid;grid-template-columns:repeat(auto-fill,minmax(250px,1fr));gap:15px;margin-top:20px}"
  ".photo-card{background:var(--card);border:1px solid var(--border);border-radius:8px;overflow:hidden;transition:transform 0.2s}"
  ".photo-card:hover{transform:scale(1.02);box-shadow:0 4px 15px rgba(0,0,0,0.2)}"
  ".photo-card img{width:100%;height:200px;object-fit:cover;background:#000}"
  ".photo-info{padding:10px;font-size:12px}"
  ".photo-name{font-weight:bold;margin-bottom:5px}"
  ".photo-size{color:#666}"
  ".btn{display:inline-block;padding:6px 12px;margin:5px 2px;background:#2196F3;color:#fff;text-decoration:none;border-radius:4px;font-size:12px}"
  ".btn-danger{background:#f44336}"
  "#loading{text-align:center;padding:40px;color:var(--text)}"
  "</style></head><body><div class='c'><a href='/' class='back'>← Back</a>"
  "<h1><span>📷 Photo Gallery</span><button class='theme-toggle' onclick='toggleTheme()'>🌓</button></h1>"
  "<div id='loading'>Loading photos...</div><div id='gallery' class='gallery'></div></div>"
  "<script>"
  "function toggleTheme(){document.body.classList.toggle('dark');localStorage.setItem('theme',document.body.classList.contains('dark')?'dark':'light')}"
  "if(localStorage.getItem('theme')==='dark')document.body.classList.add('dark');"
  "async function loadGallery(){"
  "try{"
  "const r=await fetch('/api/photos');"
  "const d=await r.json();"
  "document.getElementById('loading').style.display='none';"
  "if(d.photos.length===0){document.getElementById('gallery').innerHTML='<p>No photos found</p>';return}"
  "let html='';"
  "for(const p of d.photos){"
  "html+='<div class=\"photo-card\">';"
  "html+='<img src=\"/photo?file='+p.name+'\" alt=\"'+p.name+'\">';"
  "html+='<div class=\"photo-info\">';"
  "html+='<div class=\"photo-name\">'+p.name+'</div>';"
  "html+='<div class=\"photo-size\">'+Math.round(p.size/1024)+' KB</div>';"
  "html+='<a href=\"/photo?file='+p.name+'&download=1\" class=\"btn\">Download</a>';"
  "html+='</div></div>';"
  "}"
  "document.getElementById('gallery').innerHTML=html;"
  "}catch(e){document.getElementById('loading').innerHTML='Error loading photos: '+e}"
  "}"
  "loadGallery();"
  "</script></body></html>");

  server.send(200, "text/html", html);
  #else
  server.send(400, "text/plain", "Camera library not available");
  #endif
}

void handlePhotoList() {
  #ifdef HAS_CAMERA_LIB
  if (!sd_card_available) {
    server.send(400, "application/json", "{\"error\":\"SD card not available\"}");
    return;
  }

  File root = SD_MMC.open("/");
  if (!root || !root.isDirectory()) {
    server.send(500, "application/json", "{\"error\":\"Failed to open root directory\"}");
    return;
  }

