cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  String json = "{\"photos\":[";
  bool first = true;

  File file = root.openNextFile();
  while (file) {
    if (!file.isDirectory()) {
      String filename = String(file.name());
      // Remove leading slash if present
      if (filename.startsWith("/")) {
        filename = filename.substring(1);
      }
      if (filename.endsWith(".jpg") || filename.endsWith(".JPG")) {
        if (!first) json += ",";
        json += "{\"name\":\"" + filename + "\",\"size\":" + String(file.size()) + "}";
        first = false;
      }
    }
    file = root.openNextFile();
  }

  json += "]}";
  server.send(200, "application/json", json);
  #else
  server.send(400, "application/json", "{\"error\":\"Camera library not available\"}");
  #endif
}

void handlePhotoDownload() {
  #ifdef HAS_CAMERA_LIB
  if (!sd_card_available) {
    server.send(400, "text/plain", "SD card not available");
    return;
  }

  if (!server.hasArg("file")) {
    server.send(400, "text/plain", "Missing file parameter");
    return;
  }

  String filename = server.arg("file");
  if (!filename.startsWith("/")) filename = "/" + filename;

  File file = SD_MMC.open(filename.c_str(), FILE_READ);
  if (!file) {
    server.send(404, "text/plain", "File not found");
    return;
  }

  bool download = server.hasArg("download");
  if (download) {
    server.sendHeader("Content-Disposition", "attachment; filename=\"" + String(file.name()) + "\"");
  }

  server.streamFile(file, "image/jpeg");
  file.close();
  #else
  server.send(400, "text/plain", "Camera library not available");
  #endif
}

void handleCellularDiagnostics() {
  if (board_type != BOARD_SIM7670G) {
    server.send(400, "text/plain", "Board does not support cellular");
    return;
  }

  String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'>"
  "<title>Cellular Diagnostics - ESP32-Notifier</title><style>"
  ":root{--bg:#f0f0f0;--card:#fff;--text:#333;--text2:#555;--border:#ddd}"
  "body.dark{--bg:#1a1a1a;--card:#2d2d2d;--text:#e0e0e0;--text2:#b0b0b0;--border:#404040}"
  "body{font-family:Arial;margin:20px;background:var(--bg);color:var(--text);transition:all 0.3s}"
  ".c{max-width:900px;margin:auto;background:var(--card);padding:20px;border-radius:8px;box-shadow:0 2px 10px rgba(0,0,0,0.1)}"
  "h1{display:flex;justify-content:space-between;align-items:center}"
  ".theme-toggle{background:none;border:2px solid var(--border);padding:6px 12px;cursor:pointer;border-radius:4px;font-size:18px}"
  ".back{display:inline-block;background:#4CAF50;color:#fff;padding:8px 16px;text-decoration:none;border-radius:4px;margin-bottom:10px}"
  ".info-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(250px,1fr));gap:15px;margin:20px 0}"
  ".info-card{background:var(--card);border:1px solid var(--border);padding:15px;border-radius:8px}"
  ".info-card h3{margin:0 0 10px 0;color:var(--text2);font-size:14px;text-transform:uppercase}"
  ".info-value{font-size:24px;font-weight:bold;margin:5px 0}"
  ".status-badge{display:inline-block;padding:4px 12px;border-radius:12px;font-size:12px;font-weight:bold}"
  ".status-connected{background:#4CAF50;color:#fff}.status-disconnected{background:#f44336;color:#fff}.status-disabled{background:#999;color:#fff}"
  ".signal-meter{width:100%;height:30px;background:var(--border);border-radius:4px;overflow:hidden;margin:10px 0}"
  ".signal-fill{height:100%;transition:width 0.5s}"
  ".sig-excellent{background:#4CAF50}.sig-good{background:#8BC34A}.sig-fair{background:#FF9800}.sig-poor{background:#f44336}"
  "button{background:#2196F3;color:#fff;padding:10px 20px;border:none;border-radius:4px;cursor:pointer;margin:5px;font-size:14px}"
  "button:hover{opacity:0.9}.btn-danger{background:#f44336}"
  "#loading{text-align:center;padding:20px;color:var(--text2)}"
  ".detail-table{width:100%;border-collapse:collapse;margin:15px 0}"
  ".detail-table td{padding:8px;border-bottom:1px solid var(--border)}"
  ".detail-table td:first-child{font-weight:bold;width:40%;color:var(--text2)}"
  "</style></head><body><div class='c'><a href='/' class='back'>← Back</a>"
  "<h1><span>📶 Cellular Diagnostics</span><button class='theme-toggle' onclick='toggleTheme()'>🌓</button></h1>"
  "<div id='loading'>Loading diagnostics...</div><div id='content' style='display:none'>"
  "<div class='info-grid'>"
  "<div class='info-card'><h3>Connection Status</h3><div id='status'></div></div>"
  "<div class='info-card'><h3>Signal Strength</h3><div id='signal'></div></div>"
  "<div class='info-card'><h3>Network Type</h3><div class='info-value' id='network'></div></div>"
  "<div class='info-card'><h3>Operator</h3><div class='info-value' id='operator'></div></div>"
  "</div>"
  "<h2>Modem Information</h2><table class='detail-table'>"
  "<tr><td>Model</td><td id='model'>-</td></tr>"
  "<tr><td>IMEI</td><td id='imei'>-</td></tr>"
  "<tr><td>SIM ICCID</td><td id='iccid'>-</td></tr>"
  "<tr><td>APN</td><td id='apn'>-</td></tr>"
  "</table>"
  "<h2>Actions</h2>"
  "<button onclick='refreshData()'>🔄 Refresh Status</button>"
  "<button onclick='reconnect()' class='btn-danger'>🔌 Reconnect</button>"
  "</div></div>"
  "<script>"
  "function toggleTheme(){document.body.classList.toggle('dark');localStorage.setItem('theme',document.body.classList.contains('dark')?'dark':'light')}"
  "if(localStorage.getItem('theme')==='dark')document.body.classList.add('dark');"
  "function loadData(){fetch('/api/cellular').then(r=>r.json()).then(d=>{"
  "document.getElementById('loading').style.display='none';"
  "document.getElementById('content').style.display='block';"
  "let statusHtml='<div class=\"status-badge status-'+(d.connected?'connected':'disconnected')+'\">';"
  "statusHtml+=d.connected?'Connected':'Disconnected';"
  "statusHtml+='</div>';document.getElementById('status').innerHTML=statusHtml;"
  "let sigPct=Math.min(100,Math.round((d.signal/31)*100));"
  "let sigClass=sigPct>75?'excellent':sigPct>50?'good':sigPct>25?'fair':'poor';"
  "let sigHtml='<div class=\"info-value\">'+d.signal+'/31 ('+sigPct+'%)</div>';"
  "sigHtml+='<div class=\"signal-meter\"><div class=\"signal-fill sig-'+sigClass+'\" style=\"width:'+sigPct+'%\"></div></div>';"
  "document.getElementById('signal').innerHTML=sigHtml;"
  "document.getElementById('network').textContent=d.network_type||'Unknown';"
  "document.getElementById('operator').textContent=d.operator||'None';"
  "document.getElementById('model').textContent=d.model||'Unknown';"
  "document.getElementById('imei').textContent=d.imei||'Unknown';"
  "document.getElementById('iccid').textContent=d.iccid||'No SIM';"
  "document.getElementById('apn').textContent=d.apn||'Not set';"
  "}).catch(e=>{document.getElementById('loading').innerHTML='Error loading data: '+e})}"
  "function refreshData(){document.getElementById('loading').style.display='block';document.getElementById('content').style.display='none';"
  "fetch('/cellular/refresh').then(()=>setTimeout(loadData,2000)).catch(e=>alert('Refresh failed: '+e))}"
  "function reconnect(){if(confirm('Reconnect to cellular network? This may take 30-60 seconds.')){alert('Reconnecting... Please wait.'); refreshData()}}"
  "loadData();"
  "</script></body></html>");

  server.send(200, "text/html", html);
}

