cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
void handleCellularAPI() {
  StaticJsonDocument<512> doc;

  doc["enabled"] = cellular_enabled;
  doc["initialized"] = modem_initialized;
  doc["connected"] = cellular_connected;
  doc["operator"] = cellular_operator;
  doc["signal"] = cellular_signal_strength;
  doc["network_type"] = modem_network_type;
  doc["model"] = modem_model;
  doc["imei"] = modem_imei;
  doc["iccid"] = modem_iccid;
  doc["apn"] = apn;

  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void handleCellularRefresh() {
  if (!cellular_enabled || !modem_initialized) {
    server.send(400, "text/plain", "Cellular not enabled or modem not initialized");
    return;
  }

  // Refresh signal strength
  String response = sendATCommand("AT+CSQ");
  int rssiStart = response.indexOf(": ") + 2;
  int rssiEnd = response.indexOf(",", rssiStart);
  if (rssiStart > 1 && rssiEnd > rssiStart) {
    cellular_signal_strength = response.substring(rssiStart, rssiEnd).toInt();
  }

  // Refresh network type
  response = sendATCommand("AT+CPSI?");
  if (response.indexOf("LTE") >= 0) {
    modem_network_type = "4G LTE";
  } else if (response.indexOf("WCDMA") >= 0 || response.indexOf("HSDPA") >= 0) {
    modem_network_type = "3G";
  } else if (response.indexOf("GSM") >= 0 || response.indexOf("GPRS") >= 0) {
    modem_network_type = "2G";
  }

  // Check connection status
  response = sendATCommand("AT+CGACT?");
  cellular_connected = (response.indexOf("+CGACT: 1,1") >= 0);

  server.send(200, "text/plain", "Refreshed");
}

// ========================================
// CONNECTION HELPER FUNCTIONS
// ========================================

bool shouldUseCellular(int connectionMode) {
  // Determine if we should use cellular based on mode and availability
  switch (connectionMode) {
    case CONN_WIFI_ONLY:
      return false;
    case CONN_CELL_ONLY:
      return cellular_connected;
    case CONN_WIFI_CELL_BACKUP:
      return (wifiState != WIFI_CONNECTED && cellular_connected);
    default:
      return false;
  }
}

String getConnectionStatus() {
  String status = "";
  if (wifiState == WIFI_CONNECTED) {
    status += "WiFi: Connected";
  } else {
    status += "WiFi: Disconnected";
  }

  if (cellular_connected) {
    status += " | Cell: " + cellular_operator + " (RSSI: " + String(cellular_signal_strength) + ")";
  } else if (cellular_enabled) {
    status += " | Cell: Disconnected";
  }

  return status;
}

void sendNotifications(String title, String body, String photoFile) {
  Serial.println(F("--- Sending Notifications ---"));
  Serial.println(getConnectionStatus());

  // Add BMP180 sensor data if enabled and configured
  if (include_bmp180_in_notifications && bmp180_initialized) {
    String sensorData = getBMP180DataFormatted();
    if (sensorData.length() > 0) {
      body += "\n" + sensorData;
      Serial.println(F("Added BMP180 sensor data to notification"));
    }
  }

  // Pushbullet
  if (pushbullet_enabled && pushbullet_token.length() > 0) {
    bool useCellular = shouldUseCellular(pushbullet_conn_mode);
    if (useCellular) {
      // Send via cellular HTTP
      StaticJsonDocument<256> doc;
      doc["type"] = "note";
      doc["title"] = title;
      doc["body"] = body;
      String payload;
      serializeJson(doc, payload);

      String response = sendHTTPRequest("https://api.pushbullet.com/v2/pushes", "POST", payload);
      if (response.indexOf("200") >= 0 || response.indexOf("OK") >= 0) {
        Serial.println(F("✓ Pushbullet sent (cellular)"));
        addLog("SUCCESS", "Pushbullet sent via cellular");
      } else {
        addLog("ERROR", "Pushbullet failed via cellular");
      }
    } else if (wifiState == WIFI_CONNECTED) {
      if (!sendPushbulletNotification(title, body, photoFile)) {
        queueRetry("pushbullet", title, body);
      }
    }
  }

  // Email
  if (email_enabled && smtp_email.length() > 0 && recipient_email.length() > 0) {
    bool useCellular = shouldUseCellular(email_conn_mode);
    // Email over cellular would require complex SMTP over AT commands
    // For now, only send via WiFi
    if (!useCellular && wifiState == WIFI_CONNECTED) {
      if (!sendEmailNotification(title, body, photoFile)) {
        queueRetry("email", title, body);
      }
    } else if (useCellular) {
      Serial.println(F("Email over cellular not yet implemented, using WiFi fallback"));
      if (wifiState == WIFI_CONNECTED) {
        sendEmailNotification(title, body, photoFile);
      }
    }
  }

  // Telegram
  if (telegram_enabled && telegram_token.length() > 0 && telegram_chat_id.length() > 0) {
    bool useCellular = shouldUseCellular(telegram_conn_mode);
    if (useCellular) {
      // Send via cellular HTTP
      StaticJsonDocument<512> doc;
      doc["chat_id"] = telegram_chat_id;
      doc["text"] = body;
      String payload;
      serializeJson(doc, payload);

      String url = "https://api.telegram.org/bot" + telegram_token + "/sendMessage";
      String response = sendHTTPRequest(url, "POST", payload);
      if (response.indexOf("200") >= 0 || response.indexOf("\"ok\":true") >= 0) {
        Serial.println(F("✓ Telegram sent (cellular)"));
        addLog("SUCCESS", "Telegram sent via cellular");
      } else {
        addLog("ERROR", "Telegram failed via cellular");
      }
    } else if (wifiState == WIFI_CONNECTED) {
      if (!sendTelegramNotification(body, photoFile)) {
        queueRetry("telegram", title, body);
      }
    }
  }

  // SMS
  if (sms_enabled && sms_phone_number.length() > 0) {
    bool useCellular = shouldUseCellular(sms_conn_mode);
    if (useCellular || cellular_connected) {
      // Truncate message for SMS (160 char limit)
      String smsBody = body;
      if (smsBody.length() > 160) {
        smsBody = smsBody.substring(0, 157) + "...";
      }
      sendSMS(sms_phone_number, smsBody);
    }
  }

  Serial.println(F("--- Notifications Complete ---"));
}

void handleLogs() {
  String html = F("<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'>"
  "<meta http-equiv='refresh' content='10'><title>Logs - ESP32-Notifier</title><style>"
  "body{font-family:monospace;margin:20px;background:#1e1e1e;color:#d4d4d4}.c{max-width:1000px;margin:auto}"
  "h1{color:#4ec9b0;text-align:center}.log{margin:5px 0;padding:8px;border-radius:4px;font-size:12px;line-height:1.4}"
  ".INFO{background:#1e3a5f;border-left:4px solid #4fc3f7}"
  ".SUCCESS{background:#1e3a1e;border-left:4px solid #4caf50}"
  ".WARNING{background:#3a2e1e;border-left:4px solid #ff9800}"
  ".ERROR{background:#3a1e1e;border-left:4px solid #f44336}"
  ".time{color:#858585;margin-right:10px}.level{font-weight:bold;margin-right:10px}"
  ".back{display:inline-block;background:#4CAF50;color:#fff;padding:8px 16px;text-decoration:none;border-radius:4px;margin-bottom:10px}"
  "</style></head><body><div class='c'><a href='/' class='back'>← Back</a>"
  "<h1>System Logs</h1>");

  // Display logs in reverse order (newest first)
  int displayCount = (logCount < MAX_LOG_ENTRIES) ? logCount : MAX_LOG_ENTRIES;
  for (int i = displayCount - 1; i >= 0; i--) {
    int idx = (logIndex - 1 - i + MAX_LOG_ENTRIES) % MAX_LOG_ENTRIES;
    LogEntry &entry = logBuffer[idx];

    html += "<div class='log " + entry.level + "'>";
    html += "<span class='time'>" + htmlEncode(entry.timestamp) + "</span>";
    html += "<span class='level'>" + entry.level + "</span>";
    html += htmlEncode(entry.message);
    html += "</div>";
  }

