cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  html += F("</div></body></html>");
  server.send(200, "text/html", html);
}

bool sendPushbulletNotification(String title, String body, String photoFile) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println(F("✗ Pushbullet: WiFi down"));
    return false;
  }

  HTTPClient http;
  http.begin("https://api.pushbullet.com/v2/pushes");
  http.addHeader("Access-Token", pushbullet_token);
  http.addHeader("Content-Type", "application/json");

  StaticJsonDocument<512> doc;

  // If photo is available, send as file URL pointing to ESP32 web server
  if (photoFile.length() > 0 && sd_card_available) {
    // Get ESP32's IP address
    String ipAddr = WiFi.localIP().toString();
    String filename = photoFile;
    if (filename.startsWith("/")) filename = filename.substring(1);

    // Create photo URL accessible from the internet (if port forwarded)
    // Or accessible from local network
    String photoUrl = "http://" + ipAddr + "/photo?file=" + filename;

    doc["type"] = "link";
    doc["title"] = title;
    doc["body"] = body;
    doc["url"] = photoUrl;

    Serial.print(F("Pushbullet: Sending with photo link: "));
    Serial.println(photoUrl);
  } else {
    // No photo, send as regular note
    doc["type"] = "note";
    doc["title"] = title;
    doc["body"] = body;
  }

  String payload;
  serializeJson(doc, payload);

  int code = http.POST(payload);
  http.end();

  if (code >= 200 && code < 300) {
    Serial.println(F("✓ Pushbullet sent"));
    addLog("SUCCESS", "Pushbullet notification sent");
    return true;
  } else {
    Serial.print(F("✗ Pushbullet failed: "));
    Serial.println(code);
    addLog("ERROR", "Pushbullet failed - HTTP " + String(code));
    return false;
  }
}

bool sendEmailNotification(String subject, String body, String photoFile) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println(F("✗ Email: WiFi down"));
    return false;
  }

  ESP_Mail_Session session;
  session.server.host_name = smtp_host.c_str();
  session.server.port = smtp_port;
  session.login.email = smtp_email.c_str();
  session.login.password = smtp_password.c_str();

  SMTP_Message message;
  message.sender.name = "ESP32 Notifier";
  message.sender.email = smtp_email.c_str();
  message.subject = subject;
  message.addRecipient("", recipient_email.c_str());
  message.text.content = body.c_str();

  // Attach photo if available
  if (photoFile.length() > 0 && sd_card_available) {
    SMTP_Attachment att;
    att.descr.filename = photoFile.substring(photoFile.lastIndexOf('/') + 1);
    att.descr.mime = "image/jpeg";
    att.descr.transfer_encoding = Content_Transfer_Encoding::enc_base64;
    att.file.storage_type = esp_mail_file_storage_type_sd;
    att.file.path = photoFile.c_str();
    message.addAttachment(att);
    Serial.print(F("Email: Attaching photo "));
    Serial.println(photoFile);
  }

  // Initialize SMTP session if needed
  if (smtp == nullptr) {
    smtp = new SMTPSession();
  }

  if (!smtp->connect(&session)) {
    Serial.println(F("✗ Email: SMTP connect failed"));
    return false;
  }

  bool success = MailClient.sendMail(smtp, &message);
  smtp->closeSession();

  if (success) {
    Serial.println(F("✓ Email sent"));
    addLog("SUCCESS", "Email notification sent to " + recipient_email);
    return true;
  } else {
    Serial.print(F("✗ Email failed: "));
    Serial.println(smtp->errorReason().c_str());
    addLog("ERROR", "Email failed - " + String(smtp->errorReason().c_str()));
    return false;
  }
}

bool sendTelegramNotification(String message, String photoFile) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println(F("✗ Telegram: WiFi down"));
    return false;
  }

  HTTPClient http;

  // If photo is available, send as photo with caption
  if (photoFile.length() > 0 && sd_card_available) {
    #ifdef HAS_CAMERA_LIB
    Serial.println(F("Telegram: Sending photo..."));

    // Open the photo file
    File file = SD_MMC.open(photoFile, FILE_READ);
    if (!file) {
      Serial.println(F("✗ Telegram: Failed to open photo file"));
      // Fall back to text-only message
    } else {
      // Send photo using sendPhoto endpoint
      String url = "https://api.telegram.org/bot" + telegram_token + "/sendPhoto";

      // Create multipart boundary
      String boundary = "----WebKitFormBoundary7MA4YWxkTrZu0gW";

      http.begin(url);
      http.addHeader("Content-Type", "multipart/form-data; boundary=" + boundary);

      // Build multipart form data
      String head = "--" + boundary + "\r\n";
      head += "Content-Disposition: form-data; name=\"chat_id\"\r\n\r\n";
      head += telegram_chat_id + "\r\n";
      head += "--" + boundary + "\r\n";
      head += "Content-Disposition: form-data; name=\"caption\"\r\n\r\n";
      head += message + "\r\n";
      head += "--" + boundary + "\r\n";
      head += "Content-Disposition: form-data; name=\"photo\"; filename=\"photo.jpg\"\r\n";
      head += "Content-Type: image/jpeg\r\n\r\n";

      String tail = "\r\n--" + boundary + "--\r\n";

      // Calculate content length
      size_t fileSize = file.size();
      size_t contentLength = head.length() + fileSize + tail.length();

      http.addHeader("Content-Length", String(contentLength));

      // Send request
      WiFiClient* stream = http.getStreamPtr();
      stream->print(head);

      // Send file data in chunks
      uint8_t buffer[512];
      size_t bytesRead;
      while ((bytesRead = file.read(buffer, sizeof(buffer))) > 0) {
        stream->write(buffer, bytesRead);
        esp_task_wdt_reset(); // Keep watchdog happy during upload
      }

      stream->print(tail);
      file.close();

      int code = http.GET(); // Complete the request
      http.end();

      if (code >= 200 && code < 300) {
        Serial.println(F("✓ Telegram photo sent"));
        addLog("SUCCESS", "Telegram photo sent");
        return true;
      } else {
        Serial.print(F("✗ Telegram photo failed: "));
        Serial.println(code);
        addLog("ERROR", "Telegram photo failed - HTTP " + String(code));
        // Fall through to send text-only message
      }
    }
    #endif
  }

  // Send text-only message (fallback or when no photo)
  String url = "https://api.telegram.org/bot" + telegram_token + "/sendMessage";

  http.begin(url);
  http.addHeader("Content-Type", "application/json");

