cyberpods/esp32-notifier/esp32_notifier/esp32_notifier.ino
  StaticJsonDocument<512> doc;
  doc["chat_id"] = telegram_chat_id;
  doc["text"] = message;

  String payload;
  serializeJson(doc, payload);

  int code = http.POST(payload);
  http.end();

  if (code >= 200 && code < 300) {
    Serial.println(F("✓ Telegram sent"));
    addLog("SUCCESS", "Telegram notification sent");
    return true;
  } else {
    Serial.print(F("✗ Telegram failed: "));
    Serial.println(code);
    addLog("ERROR", "Telegram failed - HTTP " + String(code));
    return false;
  }
}

void queueRetry(String service, String title, String body) {
  NotificationRetry retry;
  retry.service = service;
  retry.title = title;
  retry.body = body;
  retry.retryTime = millis() + RETRY_DELAY;
  retry.retryCount = 0;

  retryQueue.push_back(retry);
  Serial.print(F("Queued retry for: "));
  Serial.println(service);
}

void processRetryQueue() {
  for (int i = retryQueue.size() - 1; i >= 0; i--) {
    if (millis() >= retryQueue[i].retryTime) {
      Serial.print(F("Retrying "));
      Serial.print(retryQueue[i].service);
      Serial.print(F(" (attempt "));
      Serial.print(retryQueue[i].retryCount + 1);
      Serial.println(F(")"));

      bool success = false;

      if (retryQueue[i].service == "pushbullet") {
        success = sendPushbulletNotification(retryQueue[i].title, retryQueue[i].body);
      } else if (retryQueue[i].service == "email") {
        success = sendEmailNotification(retryQueue[i].title, retryQueue[i].body);
      } else if (retryQueue[i].service == "telegram") {
        success = sendTelegramNotification(retryQueue[i].body);
      }

      if (success || retryQueue[i].retryCount >= MAX_RETRIES) {
        retryQueue.erase(retryQueue.begin() + i);
      } else {
        retryQueue[i].retryCount++;
        retryQueue[i].retryTime = millis() + (RETRY_DELAY * (retryQueue[i].retryCount + 1));
      }
    }
  }
}
